[Killed] ArrowFunction
app/vocab/services/in-memory-vocab-list.service.ts:302:51
   }
 
   public override getWithId(vocabListId: string): Observable<VocabList> {
-    const index: number = this.seedData.findIndex(vl => vl.id === vocabListId);
+    const index: number = this.seedData.findIndex(() => undefined);
 
     if (index === -1) {
killedBy: InMemoryVocabListService getWithId Should not throw an error the ID is found.
statusReason: Expected function not to throw an Error, but it threw Error.

[Killed] ConditionalExpression
app/vocab/services/in-memory-vocab-list.service.ts:302:57
   }
 
   public override getWithId(vocabListId: string): Observable<VocabList> {
-    const index: number = this.seedData.findIndex(vl => vl.id === vocabListId);
+    const index: number = this.seedData.findIndex(vl => false);
 
     if (index === -1) {
killedBy: InMemoryVocabListService getWithId Should not throw an error the ID is found.
statusReason: Expected function not to throw an Error, but it threw Error.

[Killed] BlockStatement
app/vocab/services/in-memory-vocab-list.service.ts:304:23
   public override getWithId(vocabListId: string): Observable<VocabList> {
     const index: number = this.seedData.findIndex(vl => vl.id === vocabListId);
 
-    if (index === -1) {
-      throw new Error(`Vocab with ID ${vocabListId} not found in in-memory array.`);
-    }
+    if (index === -1) {}
 
     return of(this.seedData[index])
killedBy: InMemoryVocabListService getWithId Should throw an error with the correct message if the ID is not found.
statusReason: Expected function to throw an Error.

[Killed] UnaryOperator
app/vocab/services/in-memory-vocab-list.service.ts:304:19
   public override getWithId(vocabListId: string): Observable<VocabList> {
     const index: number = this.seedData.findIndex(vl => vl.id === vocabListId);
 
-    if (index === -1) {
+    if (index === +1) {
       throw new Error(`Vocab with ID ${vocabListId} not found in in-memory array.`);
     }
killedBy: InMemoryVocabListService getWithId Should throw an error with the correct message if the ID is not found.
statusReason: Expected function to throw an Error.

[Killed] BlockStatement
app/vocab/services/in-memory-vocab-list.service.ts:317:39
   public override add(vocabList: VocabList): Observable<string> {
     vocabList.id = this.guidGenerator.generate();
 
-    vocabList.listItems.forEach(li => {
-      li.id = this.guidGenerator.generate();
-      li.vocabListId = vocabList.id;
-    });
+    vocabList.listItems.forEach(li => {});
 
     this.seedData.push(vocabList);
killedBy: InMemoryVocabListService add Should call the guid generator for the list and each list item.
statusReason: Expected spy mockGuidGenerator.generate to have been called 4 times. It was called 1 times.
