[NoCoverage] ObjectLiteral
Angular/src/app/app-routing.module.ts:7:3
 
 const routes: Routes = [
   { path: "home", title: "German Vocab App | Home", component: HomeComponent },
-  {
-    path: "vocab",
-    title: "German Vocab App | Vocab", 
-    loadChildren: () => import('./vocab/vocab.module').then(m => m.VocabModule)
-  },
+  {},
   { path: "", redirectTo: "home", pathMatch: "full" },
 ];

[NoCoverage] StringLiteral
Angular/src/app/app-routing.module.ts:9:12
   { path: "home", title: "German Vocab App | Home", component: HomeComponent },
   {
     path: "vocab",
-    title: "German Vocab App | Vocab", 
+    title: "", 
     loadChildren: () => import('./vocab/vocab.module').then(m => m.VocabModule)
   },
