[NoCoverage] ObjectLiteral
src/app/home/home-routing.module.ts:6:25
 import { HomeComponent } from './home.component';
 import { ModulesListComponent } from './modules-list/modules-list.component';
 
-const routes: Routes = [{
-  path: "home",
-  component: HomeComponent,
-  children: [
-    { path: "modules-list", component: ModulesListComponent },
-    { path: "", redirectTo: "modules-list", pathMatch: "full" }
-  ]
-}];
+const routes: Routes = [{}];
 
 @NgModule({

[NoCoverage] ArrayDeclaration
src/app/home/home-routing.module.ts:6:24
 import { HomeComponent } from './home.component';
 import { ModulesListComponent } from './modules-list/modules-list.component';
 
-const routes: Routes = [{
-  path: "home",
-  component: HomeComponent,
-  children: [
-    { path: "modules-list", component: ModulesListComponent },
-    { path: "", redirectTo: "modules-list", pathMatch: "full" }
-  ]
-}];
+const routes: Routes = [];
 
 @NgModule({

[NoCoverage] ObjectLiteral
src/app/home/home-routing.module.ts:11:5
   component: HomeComponent,
   children: [
     { path: "modules-list", component: ModulesListComponent },
-    { path: "", redirectTo: "modules-list", pathMatch: "full" }
+    {}
   ]
 }];
