[NoCoverage] BooleanLiteral
app/home/module-list-card/module-list-card.component.ts:12:39
 export class ModuleListCardComponent {
   @Input() public name!: string;
   @Input() public description!: string;
-  @Input() public disabled: boolean = false;
+  @Input() public disabled: boolean = true;
 }
 
