[Killed] BlockStatement
app/shared/services/control-availability.service.ts:9:103
   providedIn: 'root'
 })
 export class ControlAvailabilityService {
-  public configure(controls: AbstractControl<any> | AbstractControl<any>[], condition: boolean): void {
-    const controlArray: AbstractControl<any>[] = makeArray(controls);
-
-    let controlAction: (control: AbstractControl<any>) => void = this.getControlAction(condition);
-
-    controlArray.forEach((control: AbstractControl<any>) => {
-      controlAction(control);
-      control.updateValueAndValidity();
-    });
-  }
+  public configure(controls: AbstractControl<any> | AbstractControl<any>[], condition: boolean): void {}
 
   private getControlAction(result: boolean): (control: AbstractControl<any>) => void {
killedBy: ControlAvailabilityService configureControl | singular Should call control markAsUntouched with correct argument method when result is true.
statusReason: Expected spy mockControl.markAsUntouched to have been called.

[Killed] BlockStatement
app/shared/services/control-availability.service.ts:14:61
 
     let controlAction: (control: AbstractControl<any>) => void = this.getControlAction(condition);
 
-    controlArray.forEach((control: AbstractControl<any>) => {
-      controlAction(control);
-      control.updateValueAndValidity();
-    });
+    controlArray.forEach((control: AbstractControl<any>) => {});
   }
 
killedBy: ControlAvailabilityService configureControl | singular Should call control markAsUntouched with correct argument method when result is true.
statusReason: Expected spy mockControl.markAsUntouched to have been called.

[Killed] BlockStatement
app/shared/services/control-availability.service.ts:21:32
   }
 
   private getControlAction(result: boolean): (control: AbstractControl<any>) => void {
-    return result ? control => {
-      control.markAsUntouched();
-      control.addValidators([Validators.required]);
-    } : control => {
+    return result ? control => {} : control => {
       control.removeValidators([Validators.required]);
       control.setValue(null);
killedBy: ControlAvailabilityService configureControl | singular Should call control markAsUntouched with correct argument method when result is true.
statusReason: Expected spy mockControl.markAsUntouched to have been called.

[Killed] BlockStatement
app/shared/services/control-availability.service.ts:24:20
     return result ? control => {
       control.markAsUntouched();
       control.addValidators([Validators.required]);
-    } : control => {
-      control.removeValidators([Validators.required]);
-      control.setValue(null);
-    };
+    } : control => {};
   }
 }
killedBy: ControlAvailabilityService configureControl | singular Should call control removeValidators method when result is false.
statusReason: Expected spy mockControl.removeValidators to have been called only once, and with given args:
  [ [ Function ] ]
But it was never called.


Error: Expected spy mockControl.removeValidators to have been called only once, and with given args:
  [ [ Function ] ]
But it was never called.
