[NoCoverage] ArithmeticOperator
app/shared/services/guid-generator.service.ts:14:23
   }
 
   private s4(): string {
-    return Math.floor((1 + Math.random()) * 0x10000)
+    return Math.floor((1 + Math.random()) / 0x10000)
       .toString(16)
       .substring(1);

[NoCoverage] ArithmeticOperator
app/shared/services/guid-generator.service.ts:14:24
   }
 
   private s4(): string {
-    return Math.floor((1 + Math.random()) * 0x10000)
+    return Math.floor((1 - Math.random()) * 0x10000)
       .toString(16)
       .substring(1);
