[Killed] BooleanLiteral
app/vocab/pipes/definite-article.pipe.ts:10:61
 })
 export class DefiniteArticlePipe implements PipeTransform {
 
-  transform(gender : Gender | string, capitalise: boolean = true): string {
+  transform(gender : Gender | string, capitalise: boolean = false): string {
     const article: string = this.getDefiniteArticle(gender);
 
killedBy: DefiniteArticlePipe transform() With Capitalisation Should return Der when input is Masculine.
statusReason: Expected 'der' to be 'Der'.

[Killed] MethodExpression
app/vocab/pipes/definite-article.pipe.ts:13:37
   transform(gender : Gender | string, capitalise: boolean = true): string {
     const article: string = this.getDefiniteArticle(gender);
 
-    return (capitalise) ? article : article.toLowerCase();
+    return (capitalise) ? article : article.toUpperCase();
   }
 
killedBy: DefiniteArticlePipe transform() Without Capitalisation Should return der when input is Masculine.
statusReason: Expected 'DER' to be 'der'.

[Killed] ConditionalExpression
app/vocab/pipes/definite-article.pipe.ts:17:9
   }
 
   private getDefiniteArticle(gender: Gender | string): string {
-    if (gender == Gender.Masculine) {
+    if (true) {
       return "Der";
     } else if (gender == Gender.Feminine) {
killedBy: DefiniteArticlePipe transform() Should throw an error when non-gender input is provided.
statusReason: Expected function to throw an exception.

[Killed] BlockStatement
app/vocab/pipes/definite-article.pipe.ts:17:37
   }
 
   private getDefiniteArticle(gender: Gender | string): string {
-    if (gender == Gender.Masculine) {
-      return "Der";
-    } else if (gender == Gender.Feminine) {
+    if (gender == Gender.Masculine) {} else if (gender == Gender.Feminine) {
       return "Die";
     } else if (gender == Gender.Neuter) {
killedBy: DefiniteArticlePipe transform() With Capitalisation Should return Der when input is Masculine.; DefiniteArticlePipe transform() Without Capitalisation Should return der when input is Masculine.
statusReason: TypeError: Invalid noun gender value Masculine provided

[Killed] StringLiteral
app/vocab/pipes/definite-article.pipe.ts:18:14
 
   private getDefiniteArticle(gender: Gender | string): string {
     if (gender == Gender.Masculine) {
-      return "Der";
+      return "";
     } else if (gender == Gender.Feminine) {
       return "Die";
killedBy: DefiniteArticlePipe transform() With Capitalisation Should return Der when input is Masculine.; DefiniteArticlePipe transform() Without Capitalisation Should return der when input is Masculine.
statusReason: Expected '' to be 'Der'.

[Killed] ConditionalExpression
app/vocab/pipes/definite-article.pipe.ts:19:16
   private getDefiniteArticle(gender: Gender | string): string {
     if (gender == Gender.Masculine) {
       return "Der";
-    } else if (gender == Gender.Feminine) {
+    } else if (true) {
       return "Die";
     } else if (gender == Gender.Neuter) {
killedBy: DefiniteArticlePipe transform() Should throw an error when non-gender input is provided.
statusReason: Expected function to throw an exception.

[Killed] BlockStatement
app/vocab/pipes/definite-article.pipe.ts:19:43
   private getDefiniteArticle(gender: Gender | string): string {
     if (gender == Gender.Masculine) {
       return "Der";
-    } else if (gender == Gender.Feminine) {
-      return "Die";
-    } else if (gender == Gender.Neuter) {
+    } else if (gender == Gender.Feminine) {} else if (gender == Gender.Neuter) {
       return "Das";
     }
killedBy: DefiniteArticlePipe transform() With Capitalisation Should return Die when input is Feminine.; DefiniteArticlePipe transform() Without Capitalisation Should return die when input is Feminine.
statusReason: TypeError: Invalid noun gender value Feminine provided

[Killed] StringLiteral
app/vocab/pipes/definite-article.pipe.ts:20:14
     if (gender == Gender.Masculine) {
       return "Der";
     } else if (gender == Gender.Feminine) {
-      return "Die";
+      return "";
     } else if (gender == Gender.Neuter) {
       return "Das";
killedBy: DefiniteArticlePipe transform() With Capitalisation Should return Die when input is Feminine.; DefiniteArticlePipe transform() Without Capitalisation Should return die when input is Feminine.
statusReason: Expected '' to be 'Die'.

[Killed] ConditionalExpression
app/vocab/pipes/definite-article.pipe.ts:21:16
       return "Der";
     } else if (gender == Gender.Feminine) {
       return "Die";
-    } else if (gender == Gender.Neuter) {
+    } else if (true) {
       return "Das";
     }
killedBy: DefiniteArticlePipe transform() Should throw an error when non-gender input is provided.
statusReason: Expected function to throw an exception.

[Killed] ConditionalExpression
app/vocab/pipes/definite-article.pipe.ts:21:16
       return "Der";
     } else if (gender == Gender.Feminine) {
       return "Die";
-    } else if (gender == Gender.Neuter) {
+    } else if (false) {
       return "Das";
     }
killedBy: DefiniteArticlePipe transform() With Capitalisation Should return Das when input is Neuter.; DefiniteArticlePipe transform() Without Capitalisation Should return das when input is Neuter.
statusReason: TypeError: Invalid noun gender value Neuter provided
