[Killed] ConditionalExpression
app/vocab/pipes/fixed-plural-display.pipe.ts:12:7
 
   transform(value: FixedPlurality): Undefined<string> {
     switch (value) {
-      case FixedPlurality.None:
-        return undefined;
+      case FixedPlurality.None:
       case FixedPlurality.Plural:
         return "Always plural";
killedBy: FixedPluralDisplayPipe transform Should return undefined when input is None.
statusReason: Expected 'Always plural' to be undefined.

[Killed] ConditionalExpression
app/vocab/pipes/fixed-plural-display.pipe.ts:14:7
     switch (value) {
       case FixedPlurality.None:
         return undefined;
-      case FixedPlurality.Plural:
-        return "Always plural";
+      case FixedPlurality.Plural:
       case FixedPlurality.Singular:
         return "Always singular";
killedBy: FixedPluralDisplayPipe transform Should return Always plural when input is Plural.
statusReason: Expected 'Always singular' to be 'Always plural'.
