[Killed] BooleanLiteral
app/vocab/pipes/german-short-case.pipe.ts:8:48
   name: 'germanShortCase'
 })
 export class GermanShortCasePipe implements PipeTransform {
-  transform(value: Case, capitalise: boolean = true): string {
+  transform(value: Case, capitalise: boolean = false): string {
     const abbreviation: string = this.getAbbreviatedCase(value);
     return (capitalise) ? abbreviation : abbreviation.toLowerCase();
killedBy: GermanShortCasePipe transform Should return Nom. when input is Nominative and no other arguments are provided.
statusReason: Expected 'nom.' to be 'Nom.'.

[Killed] MethodExpression
app/vocab/pipes/german-short-case.pipe.ts:10:42
 export class GermanShortCasePipe implements PipeTransform {
   transform(value: Case, capitalise: boolean = true): string {
     const abbreviation: string = this.getAbbreviatedCase(value);
-    return (capitalise) ? abbreviation : abbreviation.toLowerCase();
+    return (capitalise) ? abbreviation : abbreviation.toUpperCase();
   }
 
killedBy: GermanShortCasePipe transform Should return nom. when input is Nominative when capitalise is set to false.
statusReason: Expected 'NOM.' to be 'nom.'.

[Killed] ConditionalExpression
app/vocab/pipes/german-short-case.pipe.ts:15:7
 
   private getAbbreviatedCase(value: Case): string {
     switch (value) {
-      case Case.Nominative:
-        return "Nom.";
+      case Case.Nominative:
       case Case.Accusative:
         return "Akk.";
killedBy: GermanShortCasePipe transform Should return Nom. when input is Nominative and no other arguments are provided.
statusReason: Expected 'Akk.' to be 'Nom.'.

[Killed] ConditionalExpression
app/vocab/pipes/german-short-case.pipe.ts:17:7
     switch (value) {
       case Case.Nominative:
         return "Nom.";
-      case Case.Accusative:
-        return "Akk.";
+      case Case.Accusative:
       case Case.Dative:
         return "Dat.";
killedBy: GermanShortCasePipe transform Should return Akk. when input is Accusative and no other arguments are provided.
statusReason: Expected 'Dat.' to be 'Akk.'.

[Killed] StringLiteral
app/vocab/pipes/german-short-case.pipe.ts:18:16
       case Case.Nominative:
         return "Nom.";
       case Case.Accusative:
-        return "Akk.";
+        return "";
       case Case.Dative:
         return "Dat.";
killedBy: GermanShortCasePipe transform Should return Akk. when input is Accusative and no other arguments are provided.
statusReason: Expected '' to be 'Akk.'.

[Killed] ConditionalExpression
app/vocab/pipes/german-short-case.pipe.ts:19:7
         return "Nom.";
       case Case.Accusative:
         return "Akk.";
-      case Case.Dative:
-        return "Dat.";
+      case Case.Dative:
       case Case.Genetive:
         return "Gen.";
killedBy: GermanShortCasePipe transform Should return Dat. when input is Dative and no other arguments are provided.
statusReason: Expected 'Gen.' to be 'Dat.'.

[Killed] ConditionalExpression
app/vocab/pipes/german-short-case.pipe.ts:21:7
         return "Akk.";
       case Case.Dative:
         return "Dat.";
-      case Case.Genetive:
-        return "Gen.";
+      case Case.Genetive:
       default:
         throw new Error("Invalid case given to ShortCasePipe");
killedBy: GermanShortCasePipe transform Should return Gen. when input is Genetive and no other arguments are provided.
statusReason: Error: Invalid case given to ShortCasePipe

[Killed] StringLiteral
app/vocab/pipes/german-short-case.pipe.ts:22:16
       case Case.Dative:
         return "Dat.";
       case Case.Genetive:
-        return "Gen.";
+        return "";
       default:
         throw new Error("Invalid case given to ShortCasePipe");
killedBy: GermanShortCasePipe transform Should return Gen. when input is Genetive and no other arguments are provided.
statusReason: Expected '' to be 'Gen.'.

[NoCoverage] StringLiteral
app/vocab/pipes/german-short-case.pipe.ts:24:25
       case Case.Genetive:
         return "Gen.";
       default:
-        throw new Error("Invalid case given to ShortCasePipe");
+        throw new Error("");
     }
   }
