[Killed] ConditionalExpression
app/vocab/pipes/indefinite-article.pipe.ts:17:9
   }
 
   private getIndefiniteArticle(gender: Gender | string): string {
-    if (gender === Gender.Feminine) {
+    if (true) {
       return "Eine";
     } else if (gender === Gender.Masculine || gender === Gender.Neuter) {
killedBy: IndefiniteArticlePipe transform() Should throw an error when non-gender input is provided.
statusReason: Expected function to throw an exception.

[Killed] BlockStatement
app/vocab/pipes/indefinite-article.pipe.ts:17:37
   }
 
   private getIndefiniteArticle(gender: Gender | string): string {
-    if (gender === Gender.Feminine) {
-      return "Eine";
-    } else if (gender === Gender.Masculine || gender === Gender.Neuter) {
+    if (gender === Gender.Feminine) {} else if (gender === Gender.Masculine || gender === Gender.Neuter) {
       return "Ein";
     }
killedBy: IndefiniteArticlePipe transform() With Capitalisation Should return Eine when input is Feminine.; IndefiniteArticlePipe transform() Without Capitalisation Should return eine when input is Feminine.
statusReason: TypeError: Invalid noun gender value Feminine provided

[Killed] StringLiteral
app/vocab/pipes/indefinite-article.pipe.ts:18:14
 
   private getIndefiniteArticle(gender: Gender | string): string {
     if (gender === Gender.Feminine) {
-      return "Eine";
+      return "";
     } else if (gender === Gender.Masculine || gender === Gender.Neuter) {
       return "Ein";
killedBy: IndefiniteArticlePipe transform() With Capitalisation Should return Eine when input is Feminine.; IndefiniteArticlePipe transform() Without Capitalisation Should return eine when input is Feminine.
statusReason: Expected '' to be 'Eine'.

[Killed] ConditionalExpression
app/vocab/pipes/indefinite-article.pipe.ts:19:47
   private getIndefiniteArticle(gender: Gender | string): string {
     if (gender === Gender.Feminine) {
       return "Eine";
-    } else if (gender === Gender.Masculine || gender === Gender.Neuter) {
+    } else if (gender === Gender.Masculine || false) {
       return "Ein";
     }
killedBy: IndefiniteArticlePipe transform() With Capitalisation Should return Ein when input is Neuter.; IndefiniteArticlePipe transform() Without Capitalisation Should return ein when input is Neuter.
statusReason: TypeError: Invalid noun gender value Neuter provided

[Killed] ConditionalExpression
app/vocab/pipes/indefinite-article.pipe.ts:19:16
   private getIndefiniteArticle(gender: Gender | string): string {
     if (gender === Gender.Feminine) {
       return "Eine";
-    } else if (gender === Gender.Masculine || gender === Gender.Neuter) {
+    } else if (false) {
       return "Ein";
     }
killedBy: IndefiniteArticlePipe transform() With Capitalisation Should return Ein when input is Masculine.; IndefiniteArticlePipe transform() Without Capitalisation Should return ein when input is Masculine.
statusReason: TypeError: Invalid noun gender value Masculine provided
