[Killed] BooleanLiteral
app/vocab/pipes/separable-display.pipe.ts:10:64
 })
 export class SeparableDisplayPipe implements PipeTransform {
   //TODO: Consume Separability enum rather than boolean.
-  transform(isSeparable: Vague<boolean>, capitalise: boolean = true): Undefined<string> {
+  transform(isSeparable: Vague<boolean>, capitalise: boolean = false): Undefined<string> {
     if (isNullOrUndefined(isSeparable)) {
       return undefined;
killedBy: SeparableDisplayPipe transform Should return Separable when the input is true.
statusReason: Expected 'separable' to be 'Separable'.

[Killed] BlockStatement
app/vocab/pipes/separable-display.pipe.ts:11:41
 export class SeparableDisplayPipe implements PipeTransform {
   //TODO: Consume Separability enum rather than boolean.
   transform(isSeparable: Vague<boolean>, capitalise: boolean = true): Undefined<string> {
-    if (isNullOrUndefined(isSeparable)) {
-      return undefined;
-    }
+    if (isNullOrUndefined(isSeparable)) {}
 
   //TODO: Return undefined for None.
killedBy: SeparableDisplayPipe transform Should return undefined when the input is undefined.
statusReason: Expected 'Inseparable' to be undefined.

[Killed] ConditionalExpression
app/vocab/pipes/separable-display.pipe.ts:11:9
 export class SeparableDisplayPipe implements PipeTransform {
   //TODO: Consume Separability enum rather than boolean.
   transform(isSeparable: Vague<boolean>, capitalise: boolean = true): Undefined<string> {
-    if (isNullOrUndefined(isSeparable)) {
+    if (true) {
       return undefined;
     }
killedBy: SeparableDisplayPipe transform Should return Separable when the input is true.
statusReason: Expected undefined to be 'Separable'.

[Killed] StringLiteral
app/vocab/pipes/separable-display.pipe.ts:17:43
 
   //TODO: Return undefined for None.
 
-    const output: string = isSeparable! ? "Separable" : "Inseparable";
+    const output: string = isSeparable! ? "" : "Inseparable";
     return capitalise ? output : output.toLowerCase();
   }
killedBy: SeparableDisplayPipe transform Should return Separable when the input is true.
statusReason: Expected '' to be 'Separable'.

[NoCoverage] MethodExpression
app/vocab/pipes/separable-display.pipe.ts:18:34
   //TODO: Return undefined for None.
 
     const output: string = isSeparable! ? "Separable" : "Inseparable";
-    return capitalise ? output : output.toLowerCase();
+    return capitalise ? output : output.toUpperCase();
   }
 }
