[Killed] ConditionalExpression
app/vocab/pipes/third-person-auxiliary.pipe.ts:12:9
 })
 export class ThirdPersonAuxiliaryPipe implements PipeTransform {
   transform(value: Vague<AuxiliaryVerb>): Undefined<string> {
-    if (isNullOrUndefined(value)) {
+    if (false) {
       return undefined;
     }
killedBy: ThirdPersonAuxiliaryPipe transform Should return undefined when the input is undefined.
statusReason: Error: Unhandled auxiliary verb input.

[Killed] BlockStatement
app/vocab/pipes/third-person-auxiliary.pipe.ts:12:35
 })
 export class ThirdPersonAuxiliaryPipe implements PipeTransform {
   transform(value: Vague<AuxiliaryVerb>): Undefined<string> {
-    if (isNullOrUndefined(value)) {
-      return undefined;
-    }
+    if (isNullOrUndefined(value)) {}
 
     switch (value) {
killedBy: ThirdPersonAuxiliaryPipe transform Should return undefined when the input is undefined.
statusReason: Error: Unhandled auxiliary verb input.

[Killed] ConditionalExpression
app/vocab/pipes/third-person-auxiliary.pipe.ts:17:7
     }
 
     switch (value) {
-      case AuxiliaryVerb.Haben:
-        return "hat";
+      case AuxiliaryVerb.Haben:
       case AuxiliaryVerb.Sein:
         return "ist";
killedBy: ThirdPersonAuxiliaryPipe transform Should return hat when the input is Haben.
statusReason: Expected 'ist' to be 'hat'.

[Killed] ConditionalExpression
app/vocab/pipes/third-person-auxiliary.pipe.ts:19:7
     switch (value) {
       case AuxiliaryVerb.Haben:
         return "hat";
-      case AuxiliaryVerb.Sein:
-        return "ist";
+      case AuxiliaryVerb.Sein:
       default:
         throw new Error("Unhandled auxiliary verb input.");
killedBy: ThirdPersonAuxiliaryPipe transform Should return ist when the input is Sein.
statusReason: Error: Unhandled auxiliary verb input.

[Killed] StringLiteral
app/vocab/pipes/third-person-auxiliary.pipe.ts:20:16
       case AuxiliaryVerb.Haben:
         return "hat";
       case AuxiliaryVerb.Sein:
-        return "ist";
+        return "";
       default:
         throw new Error("Unhandled auxiliary verb input.");
killedBy: ThirdPersonAuxiliaryPipe transform Should return ist when the input is Sein.
statusReason: Expected '' to be 'ist'.
