[Killed] BlockStatement
app/vocab/pipes/transitive-display.pipe.ts:10:35
 })
 export class TransitiveDisplayPipe implements PipeTransform {
   transform(value: Transitivity | undefined | null): string | undefined {
-    if (isNullOrUndefined(value)) {
-      return undefined;
-    }
+    if (isNullOrUndefined(value)) {}
 
     if (value === Transitivity.Both) {
killedBy: TransitiveDisplayPipe transform Should return undefined when the input is null.
statusReason: Expected null to equal undefined.

[Killed] ConditionalExpression
app/vocab/pipes/transitive-display.pipe.ts:10:9
 })
 export class TransitiveDisplayPipe implements PipeTransform {
   transform(value: Transitivity | undefined | null): string | undefined {
-    if (isNullOrUndefined(value)) {
+    if (false) {
       return undefined;
     }
killedBy: TransitiveDisplayPipe transform Should return undefined when the input is null.
statusReason: Expected null to equal undefined.

[Killed] ConditionalExpression
app/vocab/pipes/transitive-display.pipe.ts:14:9
       return undefined;
     }
 
-    if (value === Transitivity.Both) {
+    if (true) {
       return "Both transitive and intransitive";
     }
killedBy: TransitiveDisplayPipe transform Should return Transitive when the input is Transitive.
statusReason: Expected 'Both transitive and intransitive' to equal 'Transitive'.

[Killed] ConditionalExpression
app/vocab/pipes/transitive-display.pipe.ts:14:9
       return undefined;
     }
 
-    if (value === Transitivity.Both) {
+    if (false) {
       return "Both transitive and intransitive";
     }
killedBy: TransitiveDisplayPipe transform Should return Both transitive and intransitive when the input is Both.
statusReason: Expected 'Both' to equal 'Both transitive and intransitive'.
