[Killed] StringLiteral
app/vocab/services/http-vocab-list.service.ts:15:34
     super();
   }
 
-  private readonly url: string = "/api/vocab-lists";
+  private readonly url: string = "";
 
   public override get(): Observable<VocabList[]> {
killedBy: HttpVocabListService get Should call http.get with the correct value.; HttpVocabListService getWithId Should call http.get with the correct value.; HttpVocabListService add Should call http.get with the correct value.
statusReason: Expected spy mockHttpClient.get to have been called only once, and with given args:
  [ '/api/vocab-lists' ]
But the actual call was:
  [ '' ].
Expected $[0] = '' to equal '/api/vocab-lists'.


Error: Expected spy mockHttpClient.get to have been called only once, and with given args:
