[Killed] StringLiteral
app/vocab/services/vocab-list.resolver.ts:15:54
   constructor(private vocabListService: VocabListService) { }
 
     resolve(route: ActivatedRouteSnapshot, state: RouterStateSnapshot): Observable<VocabList> {
-      const vocabListId: string = route.paramMap.get("id")!;
+      const vocabListId: string = route.paramMap.get("")!;
       return this.vocabListService.getWithId(vocabListId);
     }
killedBy: VocabListResolver resolve() Should call VocabListService.getWithId.
statusReason: Expected spy unknown.get to have been called with:
  [ 'id' ]
but actual calls were:
  [ '' ].

Call 0:
  Expected $[0] = '' to equal 'id'.
Error: Expected spy unknown.get to have been called with:
