[Killed] BlockStatement
app/vocab/vocab-list-items/vocab-list-item.component.ts:19:47
   @Input() public item!: VocabListItem;
 
   public get isIrregular(): boolean {
-    if (this.item.wordType === WordType.Verb) {
-      return !isNullOrUndefined(this.item.thirdPersonPresent);
-    }
+    if (this.item.wordType === WordType.Verb) {}
 
     if (this.item.wordType === WordType.Adjective
killedBy: VocabListItemComponent isIrregular Verb Should return true if the third-person present is well-defined
statusReason: Expected false to be true.

[Killed] ConditionalExpression
app/vocab/vocab-list-items/vocab-list-item.component.ts:19:9
   @Input() public item!: VocabListItem;
 
   public get isIrregular(): boolean {
-    if (this.item.wordType === WordType.Verb) {
+    if (true) {
       return !isNullOrUndefined(this.item.thirdPersonPresent);
     }
killedBy: VocabListItemComponent isIrregular Adjective Should return true if the comparative is well-defined; VocabListItemComponent isIrregular Adverb Should return true if the comparative is well-defined
statusReason: Expected false to be true.

[Killed] BooleanLiteral
app/vocab/vocab-list-items/vocab-list-item.component.ts:20:14
 
   public get isIrregular(): boolean {
     if (this.item.wordType === WordType.Verb) {
-      return !isNullOrUndefined(this.item.thirdPersonPresent);
+      return isNullOrUndefined(this.item.thirdPersonPresent);
     }
 
killedBy: VocabListItemComponent isIrregular Verb Should return true if the third-person present is well-defined
statusReason: Expected false to be true.

[Killed] ConditionalExpression
app/vocab/vocab-list-items/vocab-list-item.component.ts:23:9
       return !isNullOrUndefined(this.item.thirdPersonPresent);
     }
 
-    if (this.item.wordType === WordType.Adjective
-      || this.item.wordType === WordType.Adverb) {
+    if (false) {
       return !isNullOrUndefined(this.item.comparative);
     } 
killedBy: VocabListItemComponent isIrregular Adjective Should return true if the comparative is well-defined; VocabListItemComponent isIrregular Adverb Should return true if the comparative is well-defined
statusReason: Expected false to be true.

[Killed] ConditionalExpression
app/vocab/vocab-list-items/vocab-list-item.component.ts:23:9
       return !isNullOrUndefined(this.item.thirdPersonPresent);
     }
 
-    if (this.item.wordType === WordType.Adjective
+    if (false
       || this.item.wordType === WordType.Adverb) {
       return !isNullOrUndefined(this.item.comparative);
killedBy: VocabListItemComponent isIrregular Adjective Should return true if the comparative is well-defined
statusReason: Expected false to be true.

[Killed] ConditionalExpression
app/vocab/vocab-list-items/vocab-list-item.component.ts:24:10
     }
 
     if (this.item.wordType === WordType.Adjective
-      || this.item.wordType === WordType.Adverb) {
+      || false) {
       return !isNullOrUndefined(this.item.comparative);
     } 
killedBy: VocabListItemComponent isIrregular Adverb Should return true if the comparative is well-defined
statusReason: Expected false to be true.

[Killed] BlockStatement
app/vocab/vocab-list-items/vocab-list-item.component.ts:24:50
     }
 
     if (this.item.wordType === WordType.Adjective
-      || this.item.wordType === WordType.Adverb) {
-      return !isNullOrUndefined(this.item.comparative);
-    } 
+      || this.item.wordType === WordType.Adverb) {} 
 
     return false;
killedBy: VocabListItemComponent isIrregular Adjective Should return true if the comparative is well-defined; VocabListItemComponent isIrregular Adverb Should return true if the comparative is well-defined
statusReason: Expected false to be true.

[Killed] BooleanLiteral
app/vocab/vocab-list-items/vocab-list-item.component.ts:25:14
 
     if (this.item.wordType === WordType.Adjective
       || this.item.wordType === WordType.Adverb) {
-      return !isNullOrUndefined(this.item.comparative);
+      return isNullOrUndefined(this.item.comparative);
     } 
 
killedBy: VocabListItemComponent isIrregular Adjective Should return true if the comparative is well-defined; VocabListItemComponent isIrregular Adverb Should return true if the comparative is well-defined
statusReason: Expected false to be true.
