[NoCoverage] BooleanLiteral
app/vocab/vocab-lists/vocab-lists.component.ts:19:60
 
   }
 
-  public readonly showJson$ = new BehaviorSubject<boolean>(false);
+  public readonly showJson$ = new BehaviorSubject<boolean>(true);
   public readonly jsonButtonLabel$ = this.showJson$
     .pipe(

[NoCoverage] ArrowFunction
app/vocab/vocab-lists/vocab-lists.component.ts:22:11
   public readonly showJson$ = new BehaviorSubject<boolean>(false);
   public readonly jsonButtonLabel$ = this.showJson$
     .pipe(
-      map((val: boolean) => val ? "Hide JSON" : "Show JSON"),
+      map(() => undefined),
   );
 

[NoCoverage] ArrowFunction
app/vocab/vocab-lists/vocab-lists.component.ts:30:11
   public readonly vocabLists$: Observable<VocabList[]> = this.activatedRoute.data
     .pipe(
       map((data: Data) => data[ResolvedData.ResolvedLists]),
-      tap((data: VocabList[]) => this.json$.next(data)),
+      tap(() => undefined),
     );
 

[NoCoverage] BlockStatement
app/vocab/vocab-lists/vocab-lists.component.ts:34:31
     );
 
 
-  public exportToJson(): void {
-    this.showJson$.next(!this.showJson$.value);
-  }
+  public exportToJson(): void {}
 }
 

[NoCoverage] BooleanLiteral
app/vocab/vocab-lists/vocab-lists.component.ts:35:25
 
 
   public exportToJson(): void {
-    this.showJson$.next(!this.showJson$.value);
+    this.showJson$.next(this.showJson$.value);
   }
 }
