[NoCoverage] StringLiteral
src/app/vocab/vocab-routing.module.ts:12:11
 
 const routes: Routes = [
   {
-    path: "vocab-lists",
+    path: "",
     title: "German Vocab App | Vocab | Lists",
     component: VocabListsComponent,

[NoCoverage] StringLiteral
src/app/vocab/vocab-routing.module.ts:13:12
 const routes: Routes = [
   {
     path: "vocab-lists",
-    title: "German Vocab App | Vocab | Lists",
+    title: "",
     component: VocabListsComponent,
     resolve: { resolvedVocabLists: VocabListsResolver }

[NoCoverage] ObjectLiteral
src/app/vocab/vocab-routing.module.ts:16:6
     title: "German Vocab App | Vocab | Lists",
     component: VocabListsComponent,
     resolve: { resolvedVocabLists: VocabListsResolver }
-  }, {
-    path: "vocab-lists/:id",
-    title: "German Vocab App | Vocab | Vocab List",
-    component: VocabListComponent,
-    resolve: { resolvedVocabList: VocabListResolver }
-  }, {
+  }, {}, {
     path: "vocab-list-form",
     title: "German Vocab App | Vocab | Vocab List Form",

[NoCoverage] StringLiteral
src/app/vocab/vocab-routing.module.ts:17:11
     component: VocabListsComponent,
     resolve: { resolvedVocabLists: VocabListsResolver }
   }, {
-    path: "vocab-lists/:id",
+    path: "",
     title: "German Vocab App | Vocab | Vocab List",
     component: VocabListComponent,

[NoCoverage] StringLiteral
src/app/vocab/vocab-routing.module.ts:18:12
     resolve: { resolvedVocabLists: VocabListsResolver }
   }, {
     path: "vocab-lists/:id",
-    title: "German Vocab App | Vocab | Vocab List",
+    title: "",
     component: VocabListComponent,
     resolve: { resolvedVocabList: VocabListResolver }

[NoCoverage] StringLiteral
src/app/vocab/vocab-routing.module.ts:22:11
     component: VocabListComponent,
     resolve: { resolvedVocabList: VocabListResolver }
   }, {
-    path: "vocab-list-form",
+    path: "",
     title: "German Vocab App | Vocab | Vocab List Form",
     component: VocabListFormComponent

[NoCoverage] StringLiteral
src/app/vocab/vocab-routing.module.ts:26:27
     title: "German Vocab App | Vocab | Vocab List Form",
     component: VocabListFormComponent
   },
-  { path: "", redirectTo: "vocab-lists", pathMatch: "full" },
+  { path: "", redirectTo: "", pathMatch: "full" },
 ];
 
