[NoCoverage] BlockStatement
app/vocab-forms/form-management/irregular-form-manager.ts:5:41
 import { WordTypeFormManager } from "./word-type-form-manager";
 
 export abstract class IrregularFormManager extends WordTypeFormManager {
-  public override configureForm(): void {
-    this.configureIrregularControl();
-  }
+  public override configureForm(): void {}
 
   protected abstract removeIrregularDependents(): void;

[NoCoverage] BlockStatement
app/vocab-forms/form-management/irregular-form-manager.ts:11:47
 
   protected abstract removeIrregularDependents(): void;
 
-  protected configureIrregularControl(): void {
-    const isIrregularControl: FormControl<boolean | null> = this.controls.isIrregular;
-    isIrregularControl.setValue(false);
-    isIrregularControl.addValidators([Validators.required]);
-    isIrregularControl.updateValueAndValidity();
-  }
+  protected configureIrregularControl(): void {}
 
   protected cacheAndRemoveIrregularControl(): boolean | null {

[NoCoverage] BooleanLiteral
app/vocab-forms/form-management/irregular-form-manager.ts:13:33
 
   protected configureIrregularControl(): void {
     const isIrregularControl: FormControl<boolean | null> = this.controls.isIrregular;
-    isIrregularControl.setValue(false);
+    isIrregularControl.setValue(true);
     isIrregularControl.addValidators([Validators.required]);
     isIrregularControl.updateValueAndValidity();
