[NoCoverage] BlockStatement
app/vocab-forms/form-management/modifier-form-manager.ts:5:47
 import { IrregularFormManager } from "./irregular-form-manager";
 
 export abstract class ModifierFormManager extends IrregularFormManager {
-  public override removeConfiguration(): void {
-    const wasIrregular: boolean | null = this.cacheAndRemoveIrregularControl();
-
-    if (wasIrregular !== true) {
-      return;
-    }
-    this.removeIrregularDependents();
-  }
+  public override removeConfiguration(): void {}
 
   protected override removeIrregularDependents(): void {

[NoCoverage] BooleanLiteral
app/vocab-forms/form-management/modifier-form-manager.ts:8:26
   public override removeConfiguration(): void {
     const wasIrregular: boolean | null = this.cacheAndRemoveIrregularControl();
 
-    if (wasIrregular !== true) {
+    if (wasIrregular !== false) {
       return;
     }

[NoCoverage] BlockStatement
app/vocab-forms/form-management/modifier-form-manager.ts:8:32
   public override removeConfiguration(): void {
     const wasIrregular: boolean | null = this.cacheAndRemoveIrregularControl();
 
-    if (wasIrregular !== true) {
-      return;
-    }
+    if (wasIrregular !== true) {}
     this.removeIrregularDependents();
   }

[NoCoverage] BlockStatement
app/vocab-forms/form-management/modifier-form-manager.ts:14:56
     this.removeIrregularDependents();
   }
 
-  protected override removeIrregularDependents(): void {
-    const comparativeControl: FormControl<string | null> = this.controls.comparative;
-    comparativeControl.setValue(null);
-    comparativeControl.removeValidators([Validators.required]);
-    comparativeControl.updateValueAndValidity();
-
-    const superlativeControl: FormControl<string | null> = this.controls.superlative;
-    superlativeControl.setValue(null);
-    superlativeControl.removeValidators([Validators.required]);
-    superlativeControl.updateValueAndValidity();
-  }
+  protected override removeIrregularDependents(): void {}
 }
 

[NoCoverage] ArrayDeclaration
app/vocab-forms/form-management/modifier-form-manager.ts:17:41
   protected override removeIrregularDependents(): void {
     const comparativeControl: FormControl<string | null> = this.controls.comparative;
     comparativeControl.setValue(null);
-    comparativeControl.removeValidators([Validators.required]);
+    comparativeControl.removeValidators([]);
     comparativeControl.updateValueAndValidity();
 
