[NoCoverage] BlockStatement
app/vocab-forms/form-management/noun-form-manager.ts:10:43
   public get wordType(): WordType { return WordType.Noun;  }
 
 
-    public override configureForm(): void {
-      const genderControl: FormControl<Gender | null> = this.controls.gender;
-      genderControl.addValidators([Validators.required]);
-      genderControl.updateValueAndValidity();
-
-      const fixedPluralityControl: FormControl<FixedPlurality | null> = this.controls.fixedPlurality;
-      fixedPluralityControl.setValue(FixedPlurality.None);
-      fixedPluralityControl.addValidators([Validators.required]);
-      fixedPluralityControl.updateValueAndValidity();
-
-      const isWeakMasculineNounControl: FormControl<boolean | null> = this.controls.isWeakMasculineNoun;
-      isWeakMasculineNounControl.setValue(false);
-      isWeakMasculineNounControl.addValidators([Validators.required]);
-      isWeakMasculineNounControl.updateValueAndValidity();
-    }
+    public override configureForm(): void {}
 
   public override removeConfiguration(): void {

[NoCoverage] ArrayDeclaration
app/vocab-forms/form-management/noun-form-manager.ts:17:43
 
       const fixedPluralityControl: FormControl<FixedPlurality | null> = this.controls.fixedPlurality;
       fixedPluralityControl.setValue(FixedPlurality.None);
-      fixedPluralityControl.addValidators([Validators.required]);
+      fixedPluralityControl.addValidators([]);
       fixedPluralityControl.updateValueAndValidity();
 

[NoCoverage] BooleanLiteral
app/vocab-forms/form-management/noun-form-manager.ts:21:43
       fixedPluralityControl.updateValueAndValidity();
 
       const isWeakMasculineNounControl: FormControl<boolean | null> = this.controls.isWeakMasculineNoun;
-      isWeakMasculineNounControl.setValue(false);
+      isWeakMasculineNounControl.setValue(true);
       isWeakMasculineNounControl.addValidators([Validators.required]);
       isWeakMasculineNounControl.updateValueAndValidity();

[NoCoverage] ArrayDeclaration
app/vocab-forms/form-management/noun-form-manager.ts:22:48
 
       const isWeakMasculineNounControl: FormControl<boolean | null> = this.controls.isWeakMasculineNoun;
       isWeakMasculineNounControl.setValue(false);
-      isWeakMasculineNounControl.addValidators([Validators.required]);
+      isWeakMasculineNounControl.addValidators([]);
       isWeakMasculineNounControl.updateValueAndValidity();
     }

[NoCoverage] BlockStatement
app/vocab-forms/form-management/noun-form-manager.ts:26:47
       isWeakMasculineNounControl.updateValueAndValidity();
     }
 
-  public override removeConfiguration(): void {
-    const genderControl: FormControl<Gender | null> = this.controls.gender!;
-    genderControl.reset();
-    genderControl.removeValidators([Validators.required]);
-    genderControl.updateValueAndValidity();
-
-    const prepositionControl: FormControl<string | null> = this.controls.preposition;
-    prepositionControl.reset();
-
-    const prepositionCaseControl: FormControl<string | null> = this.controls.prepositionCase;
-    prepositionCaseControl.reset();
-
-    const pluralControl: FormControl<string | null> = this.controls.plural;
-    pluralControl.reset();
-
-    const fixedPluralityControl: FormControl<FixedPlurality | null> = this.controls.fixedPlurality!;
-    fixedPluralityControl.reset();
-    fixedPluralityControl.removeValidators([Validators.required]);
-    fixedPluralityControl.updateValueAndValidity();
-
-    const isWeakMasculineNounControl: FormControl<boolean | null> = this.controls.isWeakMasculineNoun!;
-    isWeakMasculineNounControl.reset();
-    isWeakMasculineNounControl.removeValidators([Validators.required]);
-    isWeakMasculineNounControl.updateValueAndValidity();
-  }
+  public override removeConfiguration(): void {}
 }
 
