[NoCoverage] BlockStatement
app/vocab-forms/form-management/verb-form-manager.ts:8:41
 export class VerbFormManager extends IrregularFormManager {
   public get wordType(): WordType { return WordType.Verb; }
 
-  public override configureForm(): void {
-    super.configureForm();
-
-    const auxiliaryVerbControl: FormControl<AuxiliaryVerb | null> = this.controls.auxiliaryVerb!;
-    auxiliaryVerbControl.addValidators([Validators.required]);
-    auxiliaryVerbControl.updateValueAndValidity();
-
-    const isSeparableControl: FormControl<boolean | null> = this.controls.isSeparable;
-    isSeparableControl.setValue(false);
-    isSeparableControl.addValidators([Validators.required]);
-    isSeparableControl.updateValueAndValidity();
-
-    const isTransitiveControl: FormControl<boolean | null> = this.controls.isTransitive;
-    isTransitiveControl.setValue(false);
-    isTransitiveControl.addValidators([Validators.required]);
-    isTransitiveControl.updateValueAndValidity();
-  }
+  public override configureForm(): void {}
 
   public override removeConfiguration(): void {

[NoCoverage] BooleanLiteral
app/vocab-forms/form-management/verb-form-manager.ts:16:33
     auxiliaryVerbControl.updateValueAndValidity();
 
     const isSeparableControl: FormControl<boolean | null> = this.controls.isSeparable;
-    isSeparableControl.setValue(false);
+    isSeparableControl.setValue(true);
     isSeparableControl.addValidators([Validators.required]);
     isSeparableControl.updateValueAndValidity();

[NoCoverage] BooleanLiteral
app/vocab-forms/form-management/verb-form-manager.ts:21:34
     isSeparableControl.updateValueAndValidity();
 
     const isTransitiveControl: FormControl<boolean | null> = this.controls.isTransitive;
-    isTransitiveControl.setValue(false);
+    isTransitiveControl.setValue(true);
     isTransitiveControl.addValidators([Validators.required]);
     isTransitiveControl.updateValueAndValidity();

[NoCoverage] ArrayDeclaration
app/vocab-forms/form-management/verb-form-manager.ts:42:41
 
     const isSeparableControl: FormControl<boolean | null> = this.controls.isSeparable;
     isSeparableControl.reset();
-    isSeparableControl.removeValidators([Validators.required]);
+    isSeparableControl.removeValidators([]);
     isSeparableControl.updateValueAndValidity();
 

[NoCoverage] ConditionalExpression
app/vocab-forms/form-management/verb-form-manager.ts:52:9
 
     const wasIrregular: boolean | null = this.cacheAndRemoveIrregularControl();
 
-    if (wasIrregular !== true) {
+    if (true) {
       return;
     }

[NoCoverage] BlockStatement
app/vocab-forms/form-management/verb-form-manager.ts:58:56
     this.removeIrregularDependents();
   }
 
-  protected override removeIrregularDependents(): void {
-    const thirdPersonPresentControl: FormControl<string | null> = this.controls.thirdPersonPresent;
-    thirdPersonPresentControl.reset();
-    thirdPersonPresentControl.removeValidators([Validators.required]);
-    thirdPersonPresentControl.updateValueAndValidity();
-
-    const thirdPersonImperfectControl: FormControl<string | null> = this.controls.thirdPersonImperfect;
-    thirdPersonImperfectControl.reset();
-    thirdPersonImperfectControl.removeValidators([Validators.required]);
-    thirdPersonImperfectControl.updateValueAndValidity();
-  }
+  protected override removeIrregularDependents(): void {}
 }
 
