[Killed] ConditionalExpression
app/vocab-forms/services/form-manager-factory.ts:13:7
 export class WordTypeFormManagerFactory {
   public create(wordType: WordType, form: FormGroup<VocabListItemForm>): WordTypeFormManager {
     switch (wordType) {
-      case WordType.None: {
-        throw new Error("Unable to create word type form manager from None word type.")
-      } case WordType.Noun: {
+      case WordType.None: case WordType.Noun: {
         return new NounFormManager(form)
       } case WordType.Verb: {
killedBy: WordTypeFormManagerFactory create() Should throw exception when word type is None.
statusReason: Expected function to throw an exception.

[Killed] ConditionalExpression
app/vocab-forms/services/form-manager-factory.ts:15:9
     switch (wordType) {
       case WordType.None: {
         throw new Error("Unable to create word type form manager from None word type.")
-      } case WordType.Noun: {
-        return new NounFormManager(form)
-      } case WordType.Verb: {
+      } case WordType.Noun: case WordType.Verb: {
         return new VerbFormManager(form)
       } case WordType.Adjective: {
killedBy: WordTypeFormManagerFactory create() Should produce Noun FormManager when word type is Noun
statusReason: Expected 'Verb' to be 'Noun'.

[Killed] ConditionalExpression
app/vocab-forms/services/form-manager-factory.ts:17:9
         throw new Error("Unable to create word type form manager from None word type.")
       } case WordType.Noun: {
         return new NounFormManager(form)
-      } case WordType.Verb: {
-        return new VerbFormManager(form)
-      } case WordType.Adjective: {
+      } case WordType.Verb: case WordType.Adjective: {
         return new AdjectiveFormManager(form);
       } case WordType.Adverb: {
killedBy: WordTypeFormManagerFactory create() Should produce Verb FormManager when word type is Verb
statusReason: Expected 'Adjective' to be 'Verb'.

[Killed] ConditionalExpression
app/vocab-forms/services/form-manager-factory.ts:19:9
         return new NounFormManager(form)
       } case WordType.Verb: {
         return new VerbFormManager(form)
-      } case WordType.Adjective: {
-        return new AdjectiveFormManager(form);
-      } case WordType.Adverb: {
+      } case WordType.Adjective: case WordType.Adverb: {
         return new AdverbFormManager(form);
       }
killedBy: WordTypeFormManagerFactory create() Should produce Adjective FormManager when word type is Adjective
statusReason: Expected 'Adverb' to be 'Adjective'.
