[NoCoverage] StringLiteral
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:24:8
   private readonly listItemControlCount = new BehaviorSubject<number>(0);
   private readonly wordingDict: { [key: number]: string } = {
     0: "Why not add something, sugar?",
-    1: "Ooh yeah. You like that?",
+    1: "",
     2: "Give me some more, baby.",
     3: "I see someone's thirsty...",

[NoCoverage] StringLiteral
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:27:8
     1: "Ooh yeah. You like that?",
     2: "Give me some more, baby.",
     3: "I see someone's thirsty...",
-    4: "Thirsty for vocab",
+    4: "",
     5: "Okay now, let's maybe calm down a bit.",
     6: "You've had enough.",

[NoCoverage] StringLiteral
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:28:8
     2: "Give me some more, baby.",
     3: "I see someone's thirsty...",
     4: "Thirsty for vocab",
-    5: "Okay now, let's maybe calm down a bit.",
+    5: "",
     6: "You've had enough.",
     7: "You're scaring me.",

[NoCoverage] StringLiteral
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:31:8
     5: "Okay now, let's maybe calm down a bit.",
     6: "You've had enough.",
     7: "You're scaring me.",
-    8: "I can't watch you do this to yourself.",
+    8: "",
     9: "I'm leaving.",
     10: "You're on you're own now.",

[NoCoverage] StringLiteral
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:32:8
     6: "You've had enough.",
     7: "You're scaring me.",
     8: "I can't watch you do this to yourself.",
-    9: "I'm leaving.",
+    9: "",
     10: "You're on you're own now.",
     11: "",

[NoCoverage] StringLiteral
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:33:9
     7: "You're scaring me.",
     8: "I can't watch you do this to yourself.",
     9: "I'm leaving.",
-    10: "You're on you're own now.",
+    10: "",
     11: "",
   }

[NoCoverage] StringLiteral
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:34:9
     8: "I can't watch you do this to yourself.",
     9: "I'm leaving.",
     10: "You're on you're own now.",
-    11: "",
+    11: "Stryker was here!",
   }
 

[NoCoverage] ConditionalExpression
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:40:31
   public readonly listItemControlCount$: Observable<number> = this.listItemControlCount.asObservable();
   public readonly placeholderWording$: Observable<string> = this.listItemControlCount$
     .pipe(
-      filter((val: number) => val <= 11),
+      filter((val: number) => true),
       map((count: number) => this.wordingDict[count]),
     );

[NoCoverage] ConditionalExpression
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:40:31
   public readonly listItemControlCount$: Observable<number> = this.listItemControlCount.asObservable();
   public readonly placeholderWording$: Observable<string> = this.listItemControlCount$
     .pipe(
-      filter((val: number) => val <= 11),
+      filter((val: number) => false),
       map((count: number) => this.wordingDict[count]),
     );

[NoCoverage] BlockStatement
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:54:20
   public vocabListTitle$!: Observable<string>;
   public descriptionLength$!: Observable<number>;
 
-  ngOnInit(): void {
-    // Check function is called
-    // Check vocabListForm property has expected value
-    this.vocabListForm = this.listFormBuilder.build();
-    this.vocabListTitle$ = this.vocabListForm.controls.name.valueChanges
-      .pipe(
-        startWith("New vocab list"),
-        debounceTime(300),
-        map((val: string | null) => (!val || val === "") ? "New vocab list" : val),
-    );
-    this.descriptionLength$ = this.vocabListForm.controls.description.valueChanges
-      .pipe(
-        map((val: string | null) => val ? val.length : 0),
-        filter((result: number) => result > 150),
-    )
-  }
+  ngOnInit(): void {}
 
   public addListItemControl(): void {

[NoCoverage] ConditionalExpression
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:62:46
       .pipe(
         startWith("New vocab list"),
         debounceTime(300),
-        map((val: string | null) => (!val || val === "") ? "New vocab list" : val),
+        map((val: string | null) => (!val || false) ? "New vocab list" : val),
     );
     this.descriptionLength$ = this.vocabListForm.controls.description.valueChanges

[NoCoverage] EqualityOperator
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:62:46
       .pipe(
         startWith("New vocab list"),
         debounceTime(300),
-        map((val: string | null) => (!val || val === "") ? "New vocab list" : val),
+        map((val: string | null) => (!val || val !== "") ? "New vocab list" : val),
     );
     this.descriptionLength$ = this.vocabListForm.controls.description.valueChanges

[NoCoverage] EqualityOperator
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:67:36
     this.descriptionLength$ = this.vocabListForm.controls.description.valueChanges
       .pipe(
         map((val: string | null) => val ? val.length : 0),
-        filter((result: number) => result > 150),
+        filter((result: number) => result <= 150),
     )
   }

[NoCoverage] EqualityOperator
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:67:36
     this.descriptionLength$ = this.vocabListForm.controls.description.valueChanges
       .pipe(
         map((val: string | null) => val ? val.length : 0),
-        filter((result: number) => result > 150),
+        filter((result: number) => result >= 150),
     )
   }

[NoCoverage] BlockStatement
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:71:37
     )
   }
 
-  public addListItemControl(): void {
-    // Check expected control is in the list?? nah, that requires testing FormArray
-    this.listItemsControl.push(this.generateListItemControl());
-    // Test that the count has increase (via the observable rather than the private field).
-    this.listItemControlCount.next(this.listItemsControl.length);
-  }
+  public addListItemControl(): void {}
 
   private generateListItemControl(): FormGroup {

[NoCoverage] BlockStatement
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:88:53
     return <FormGroup>this.listItemsControl.get(`${index}`);
   }
 
-  public removeListItemControl(index: number): void {
-    if (index < 0) {
-      // Check an exception is thrown.
-      //Update to throw exception.
-      console.error("Index may not be negative.")
-      return;
-    } else if (index >= this.listItemsControl.length) {
-      // Check an exception is thrown.
-      //Update to throw exception.
-      console.error("Index exceeds the size of the list items form control array.")
-      return;
-    }
-    // Check control count has decreased.
-    // Check expected control has been removed.
-    this.listItemsControl.controls.splice(index, 1);
-    this.listItemControlCount.next(this.listItemsControl.length);
-  }
+  public removeListItemControl(index: number): void {}
 
   public onFormSubmit(): void {

[NoCoverage] EqualityOperator
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:89:9
   }
 
   public removeListItemControl(index: number): void {
-    if (index < 0) {
+    if (index >= 0) {
       // Check an exception is thrown.
       //Update to throw exception.

[NoCoverage] BlockStatement
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:89:20
   }
 
   public removeListItemControl(index: number): void {
-    if (index < 0) {
-      // Check an exception is thrown.
-      //Update to throw exception.
-      console.error("Index may not be negative.")
-      return;
-    } else if (index >= this.listItemsControl.length) {
+    if (index < 0) {} else if (index >= this.listItemsControl.length) {
       // Check an exception is thrown.
       //Update to throw exception.

[NoCoverage] ConditionalExpression
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:94:16
       //Update to throw exception.
       console.error("Index may not be negative.")
       return;
-    } else if (index >= this.listItemsControl.length) {
+    } else if (false) {
       // Check an exception is thrown.
       //Update to throw exception.

[NoCoverage] BlockStatement
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:94:55
       //Update to throw exception.
       console.error("Index may not be negative.")
       return;
-    } else if (index >= this.listItemsControl.length) {
-      // Check an exception is thrown.
-      //Update to throw exception.
-      console.error("Index exceeds the size of the list items form control array.")
-      return;
-    }
+    } else if (index >= this.listItemsControl.length) {}
     // Check control count has decreased.
     // Check expected control has been removed.

[NoCoverage] BlockStatement
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:106:31
     this.listItemControlCount.next(this.listItemsControl.length);
   }
 
-  public onFormSubmit(): void {
-    const vocabList: VocabList = this.vocabListForm.value as VocabList;
-    // Check vocab list service method is called with correct ID.
-
-    const addVocabListSubsc = this.vocabService.add(vocabList)
-      .subscribe(newListId => {
-        // Check router navigation is done correctly?
-        this.router.navigate(["/vocab", "vocab-lists"]);
-        addVocabListSubsc.unsubscribe();
-      });
-  }
+  public onFormSubmit(): void {}
 }
 

[NoCoverage] BlockStatement
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:111:31
     // Check vocab list service method is called with correct ID.
 
     const addVocabListSubsc = this.vocabService.add(vocabList)
-      .subscribe(newListId => {
-        // Check router navigation is done correctly?
-        this.router.navigate(["/vocab", "vocab-lists"]);
-        addVocabListSubsc.unsubscribe();
-      });
+      .subscribe(newListId => {});
   }
 }

[NoCoverage] StringLiteral
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:113:41
     const addVocabListSubsc = this.vocabService.add(vocabList)
       .subscribe(newListId => {
         // Check router navigation is done correctly?
-        this.router.navigate(["/vocab", "vocab-lists"]);
+        this.router.navigate(["/vocab", ""]);
         addVocabListSubsc.unsubscribe();
       });
