[NoCoverage] ArrayDeclaration
app/vocab-forms/vocab-list-item-form/drop-down-options.class.ts:5:76
 import { WordType } from "../../vocab/models/data";
 
 export class DropDownOptions {
-  public static readonly wordTypeOptions: SingleSelectOption<WordType>[] = [{
-    value: WordType.Noun,
-    label: "Noun",
-  }, {
-    value: WordType.Verb,
-    label: "Verb",
-  }, {
-    value: WordType.Adjective,
-    label: "Adjective",
-  }, {
-    value: WordType.Adverb,
-    label: "Adverb",
-  }];
+  public static readonly wordTypeOptions: SingleSelectOption<WordType>[] = [];
 }
 

[NoCoverage] StringLiteral
app/vocab-forms/vocab-list-item-form/drop-down-options.class.ts:7:12
 export class DropDownOptions {
   public static readonly wordTypeOptions: SingleSelectOption<WordType>[] = [{
     value: WordType.Noun,
-    label: "Noun",
+    label: "",
   }, {
     value: WordType.Verb,

[NoCoverage] StringLiteral
app/vocab-forms/vocab-list-item-form/drop-down-options.class.ts:13:12
     label: "Verb",
   }, {
     value: WordType.Adjective,
-    label: "Adjective",
+    label: "",
   }, {
     value: WordType.Adverb,

[NoCoverage] StringLiteral
app/vocab-forms/vocab-list-item-form/drop-down-options.class.ts:16:12
     label: "Adjective",
   }, {
     value: WordType.Adverb,
-    label: "Adverb",
+    label: "",
   }];
 }
