[NoCoverage] ArrayDeclaration
app/vocab-forms/word-type-forms/drop-down-options.class.ts:19:86
     label: "Genetive",
   }];
 
-  public static readonly reflexiveCaseOptions: SingleSelectOption<ReflexiveCase>[] = [{
-    value: ReflexiveCase.Accusative,
-    label: "Accusative",
-  }, {
-    value: ReflexiveCase.Dative,
-    label: "Dative",
-  }];
+  public static readonly reflexiveCaseOptions: SingleSelectOption<ReflexiveCase>[] = [];
 
   public static readonly auxiliaryVerbOptions: SingleSelectOption<AuxiliaryVerb>[] = [{

[NoCoverage] StringLiteral
app/vocab-forms/word-type-forms/drop-down-options.class.ts:29:12
 
   public static readonly auxiliaryVerbOptions: SingleSelectOption<AuxiliaryVerb>[] = [{
     value: AuxiliaryVerb.Haben,
-    label: "Haben",
+    label: "",
   }, {
     value: AuxiliaryVerb.Sein,

[NoCoverage] StringLiteral
app/vocab-forms/word-type-forms/drop-down-options.class.ts:32:12
     label: "Haben",
   }, {
     value: AuxiliaryVerb.Sein,
-    label: "Sein",
+    label: "",
   }];
 

[NoCoverage] StringLiteral
app/vocab-forms/word-type-forms/drop-down-options.class.ts:37:12
 
   public static readonly genderOptions: SingleSelectOption<Gender>[] = [{
     value: Gender.Masculine,
-    label: "Masculine",
+    label: "",
   }, {
     value: Gender.Feminine,
