[NoCoverage] BlockStatement
app/vocab-forms/word-type-forms/modifier-word-type-form.ts:14:36
     super(controlAvailabilityService);
   }
 
-  public override ngOnInit(): void {
-    super.ngOnInit();
-
-    this.irregularControls = [
-      this.form.controls.comparative!,
-      this.form.controls.superlative!,
-    ];
-
-    this.isIrregular = this.isIrregular$.subscribe((result: boolean) => {
-      this.controlAvailabilityService.configure(this.irregularControls, result);
-    });
-  }
+  public override ngOnInit(): void {}
 
   public ngOnDestroy(): void {

[NoCoverage] BlockStatement
app/vocab-forms/word-type-forms/modifier-word-type-form.ts:22:73
       this.form.controls.superlative!,
     ];
 
-    this.isIrregular = this.isIrregular$.subscribe((result: boolean) => {
-      this.controlAvailabilityService.configure(this.irregularControls, result);
-    });
+    this.isIrregular = this.isIrregular$.subscribe((result: boolean) => {});
   }
 

[NoCoverage] BlockStatement
app/vocab-forms/word-type-forms/modifier-word-type-form.ts:27:30
     });
   }
 
-  public ngOnDestroy(): void {
-    this.isIrregular.unsubscribe();
-  }
+  public ngOnDestroy(): void {}
 }
 
