[NoCoverage] BlockStatement
vocab-forms/word-type-forms/noun-form/noun-form.component.ts:25:36
     super(controlAvailabilityService);
   }
 
-  public override ngOnInit(): void {
-    super.ngOnInit();
-    //TODO: Clear fixed plural value when we are removing the control
-    this.hasFixedPlural$ = this.form.controls.fixedPlurality!.valueChanges
-      .pipe(
-        filter((val: FixedPlurality | null)  => val !== null),
-        map(val => val !== FixedPlurality.None),
-    );
-
-    this.hasPreposition$
-      .pipe(takeUntil(this.destroy$))
-      .subscribe((result: boolean) => {
-        const prepositionCaseControl: FormControl<Case | null> = this.form.controls.prepositionCase!
-      this.controlAvailabilityService.configure(prepositionCaseControl, result);
-    });
-  }
+  public override ngOnInit(): void {}
 
   public ngOnDestroy(): void {

[NoCoverage] ConditionalExpression
vocab-forms/word-type-forms/noun-form/noun-form.component.ts:30:49
     //TODO: Clear fixed plural value when we are removing the control
     this.hasFixedPlural$ = this.form.controls.fixedPlurality!.valueChanges
       .pipe(
-        filter((val: FixedPlurality | null)  => val !== null),
+        filter((val: FixedPlurality | null)  => true),
         map(val => val !== FixedPlurality.None),
     );

[NoCoverage] ConditionalExpression
vocab-forms/word-type-forms/noun-form/noun-form.component.ts:30:49
     //TODO: Clear fixed plural value when we are removing the control
     this.hasFixedPlural$ = this.form.controls.fixedPlurality!.valueChanges
       .pipe(
-        filter((val: FixedPlurality | null)  => val !== null),
+        filter((val: FixedPlurality | null)  => false),
         map(val => val !== FixedPlurality.None),
     );

[NoCoverage] ConditionalExpression
vocab-forms/word-type-forms/noun-form/noun-form.component.ts:31:20
     this.hasFixedPlural$ = this.form.controls.fixedPlurality!.valueChanges
       .pipe(
         filter((val: FixedPlurality | null)  => val !== null),
-        map(val => val !== FixedPlurality.None),
+        map(val => true),
     );
 

[NoCoverage] ConditionalExpression
vocab-forms/word-type-forms/noun-form/noun-form.component.ts:31:20
     this.hasFixedPlural$ = this.form.controls.fixedPlurality!.valueChanges
       .pipe(
         filter((val: FixedPlurality | null)  => val !== null),
-        map(val => val !== FixedPlurality.None),
+        map(val => false),
     );
 

[NoCoverage] BlockStatement
vocab-forms/word-type-forms/noun-form/noun-form.component.ts:36:39
 
     this.hasPreposition$
       .pipe(takeUntil(this.destroy$))
-      .subscribe((result: boolean) => {
-        const prepositionCaseControl: FormControl<Case | null> = this.form.controls.prepositionCase!
-      this.controlAvailabilityService.configure(prepositionCaseControl, result);
-    });
+      .subscribe((result: boolean) => {});
   }
 

[NoCoverage] BlockStatement
vocab-forms/word-type-forms/noun-form/noun-form.component.ts:42:30
     });
   }
 
-  public ngOnDestroy(): void {
-    this.destroy$.next(true);
-    this.destroy$.unsubscribe();
-  }
+  public ngOnDestroy(): void {}
 }
 

[NoCoverage] BooleanLiteral
vocab-forms/word-type-forms/noun-form/noun-form.component.ts:43:24
   }
 
   public ngOnDestroy(): void {
-    this.destroy$.next(true);
+    this.destroy$.next(false);
     this.destroy$.unsubscribe();
   }
