[NoCoverage] BlockStatement
vocab-forms/word-type-forms/verb-form/verb-form.component.ts:22:36
     super(controlAvailabilityService);
   }
 
-  public override ngOnInit(): void {
-    super.ngOnInit();
-
-    this.irregularControls = [
-      this.form.controls.thirdPersonPresent!,
-      this.form.controls.thirdPersonImperfect!,
-      this.form.controls.perfect!,
-    ];
-
-    this.hasPreposition$
-      .pipe(takeUntil(this.destroy$))
-      .subscribe((result: boolean) => {
-        const prepositionCaseControl: FormControl<Case | null> = this.form.controls.prepositionCase!
-        this.controlAvailabilityService.configure(prepositionCaseControl, result);
-      });
-
-    this.isIrregular$
-      .pipe(takeUntil(this.destroy$))
-      .subscribe((result: boolean) => {
-        this.controlAvailabilityService.configure(this.irregularControls, result);
-    });
-  }
+  public override ngOnInit(): void {}
 
   public ngOnDestroy(): void {

[NoCoverage] BlockStatement
vocab-forms/word-type-forms/verb-form/verb-form.component.ts:40:39
 
     this.isIrregular$
       .pipe(takeUntil(this.destroy$))
-      .subscribe((result: boolean) => {
-        this.controlAvailabilityService.configure(this.irregularControls, result);
-    });
+      .subscribe((result: boolean) => {});
   }
 
