[NoCoverage] BlockStatement
app/vocab-forms/word-type-forms/word-type-form.ts:34:27
 
   public get formRoot(): FormGroup { return this.form.root as FormGroup; }
 
-  public ngOnInit(): void {
-    this.isIrregular$ = this.form.controls.isIrregular!.valueChanges
-      .pipe(
-        map(val => val ?? false)
-      );
-
-    this.hasPreposition$ = this.form.controls.preposition!.valueChanges
-      .pipe(
-        debounceTime(250),
-        filter((val: NullableString) => val !== null && val !== undefined),
-        map((val: NullableString) => val as string),
-        map((val: string) => val.length > 0),
-        tap((result: boolean) => this.displayPrepositionCase.next(result)),
-      );
-  }
+  public ngOnInit(): void {}
 }
 

[NoCoverage] BooleanLiteral
app/vocab-forms/word-type-forms/word-type-form.ts:37:27
   public ngOnInit(): void {
     this.isIrregular$ = this.form.controls.isIrregular!.valueChanges
       .pipe(
-        map(val => val ?? false)
+        map(val => val ?? true)
       );
 

[NoCoverage] EqualityOperator
app/vocab-forms/word-type-forms/word-type-form.ts:43:57
     this.hasPreposition$ = this.form.controls.preposition!.valueChanges
       .pipe(
         debounceTime(250),
-        filter((val: NullableString) => val !== null && val !== undefined),
+        filter((val: NullableString) => val !== null && val === undefined),
         map((val: NullableString) => val as string),
         map((val: string) => val.length > 0),

[NoCoverage] LogicalOperator
app/vocab-forms/word-type-forms/word-type-form.ts:43:41
     this.hasPreposition$ = this.form.controls.preposition!.valueChanges
       .pipe(
         debounceTime(250),
-        filter((val: NullableString) => val !== null && val !== undefined),
+        filter((val: NullableString) => val !== null || val !== undefined),
         map((val: NullableString) => val as string),
         map((val: string) => val.length > 0),

[NoCoverage] EqualityOperator
app/vocab-forms/word-type-forms/word-type-form.ts:45:30
         debounceTime(250),
         filter((val: NullableString) => val !== null && val !== undefined),
         map((val: NullableString) => val as string),
-        map((val: string) => val.length > 0),
+        map((val: string) => val.length <= 0),
         tap((result: boolean) => this.displayPrepositionCase.next(result)),
       );

[NoCoverage] ConditionalExpression
app/vocab-forms/word-type-forms/word-type-form.ts:45:30
         debounceTime(250),
         filter((val: NullableString) => val !== null && val !== undefined),
         map((val: NullableString) => val as string),
-        map((val: string) => val.length > 0),
+        map((val: string) => true),
         tap((result: boolean) => this.displayPrepositionCase.next(result)),
       );

[NoCoverage] ArrowFunction
app/vocab-forms/word-type-forms/word-type-form.ts:46:13
         filter((val: NullableString) => val !== null && val !== undefined),
         map((val: NullableString) => val as string),
         map((val: string) => val.length > 0),
-        tap((result: boolean) => this.displayPrepositionCase.next(result)),
+        tap(() => undefined),
       );
   }
