[Killed] ArrayDeclaration
Angular/src/utilities/array.utilities.ts:5:41
   if (!items) {
     return [];
   }
-  return Array.isArray(items) ? items : [items]
+  return Array.isArray(items) ? items : []
 }
 
killedBy: ControlAvailabilityService configureControl | singular Should call control markAsUntouched with correct argument method when result is true.; ArrayUtilities makeArray Should return an array of length one when a single item is provided.
statusReason: Expected spy mockControl.markAsUntouched to have been called.
