[Killed] ConditionalExpression
Angular/src/utilities/object.utilities.ts:2:10
 export function isNullOrUndefined(object: any): boolean {
-  return object === undefined
-      || object === null;
+  return false;
 }
 
killedBy: SeparableDisplayPipe transform Should return undefined when the input is undefined.; ThirdPersonAuxiliaryPipe transform Should return undefined when the input is undefined.; TransitiveDisplayPipe transform Should return undefined when the input is null.
statusReason: Expected 'Inseparable' to be undefined.

[Killed] ConditionalExpression
Angular/src/utilities/object.utilities.ts:2:10
 export function isNullOrUndefined(object: any): boolean {
-  return object === undefined
+  return false
       || object === null;
 }
killedBy: SeparableDisplayPipe transform Should return undefined when the input is undefined.; ThirdPersonAuxiliaryPipe transform Should return undefined when the input is undefined.; VocabListItemComponent isIrregular Verb Should return false if the third-person present is undefined
statusReason: Expected 'Inseparable' to be undefined.

[Killed] EqualityOperator
Angular/src/utilities/object.utilities.ts:3:10
 export function isNullOrUndefined(object: any): boolean {
   return object === undefined
-      || object === null;
+      || object !== null;
 }
 
killedBy: SeparableDisplayPipe transform Should return Separable when the input is true.; ThirdPersonAuxiliaryPipe transform Should return hat when the input is Haben.; TransitiveDisplayPipe transform Should return Transitive when the input is Transitive.
statusReason: Expected undefined to be 'Separable'.

[Killed] ConditionalExpression
Angular/src/utilities/object.utilities.ts:3:10
 export function isNullOrUndefined(object: any): boolean {
   return object === undefined
-      || object === null;
+      || false;
 }
 
killedBy: SeparableDisplayPipe transform Should return undefined when the input is null.; ThirdPersonAuxiliaryPipe transform Should return undefined when the input is null.; TransitiveDisplayPipe transform Should return undefined when the input is null.
statusReason: Expected 'Inseparable' to be undefined.
