[NoCoverage] EqualityOperator
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:42:31
   public readonly listItemControlCount$: Observable<number> = this.listItemControlCount.asObservable();
   public readonly placeholderWording$: Observable<string> = this.listItemControlCount$
     .pipe(
-      filter((val: number) => val <= 11),
+      filter((val: number) => val < 11),
       map((count: number) => this.wordingDict[count]),
     );

[NoCoverage] EqualityOperator
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:42:31
   public readonly listItemControlCount$: Observable<number> = this.listItemControlCount.asObservable();
   public readonly placeholderWording$: Observable<string> = this.listItemControlCount$
     .pipe(
-      filter((val: number) => val <= 11),
+      filter((val: number) => val > 11),
       map((count: number) => this.wordingDict[count]),
     );

[NoCoverage] ConditionalExpression
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:69:36
     this.descriptionLength$ = this.vocabListForm.controls.description.valueChanges
       .pipe(
         map((val: string | null) => val ? val.length : 0),
-        filter((result: number) => result > 150),
+        filter((result: number) => false),
     )
   }

[NoCoverage] StringLiteral
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:87:49
 
   public getListItemControl(index: number): FormGroup {
     // Mayeb can't test this one.
-    return <FormGroup>this.listItemsControl.get(`${index}`);
+    return <FormGroup>this.listItemsControl.get(``);
   }
 

[NoCoverage] ConditionalExpression
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:91:9
   }
 
   public removeListItemControl(index: number): void {
-    if (index < 0) {
+    if (false) {
       // Check an exception is thrown.
       //Update to throw exception.

[NoCoverage] EqualityOperator
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:91:9
   }
 
   public removeListItemControl(index: number): void {
-    if (index < 0) {
+    if (index <= 0) {
       // Check an exception is thrown.
       //Update to throw exception.

[NoCoverage] StringLiteral
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:94:21
     if (index < 0) {
       // Check an exception is thrown.
       //Update to throw exception.
-      console.error("Index may not be negative.")
+      console.error("")
       return;
     } else if (index >= this.listItemsControl.length) {

[NoCoverage] EqualityOperator
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:96:16
       //Update to throw exception.
       console.error("Index may not be negative.")
       return;
-    } else if (index >= this.listItemsControl.length) {
+    } else if (index < this.listItemsControl.length) {
       // Check an exception is thrown.
       //Update to throw exception.

[NoCoverage] ConditionalExpression
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:96:16
       //Update to throw exception.
       console.error("Index may not be negative.")
       return;
-    } else if (index >= this.listItemsControl.length) {
+    } else if (true) {
       // Check an exception is thrown.
       //Update to throw exception.

[NoCoverage] StringLiteral
app/vocab-forms/vocab-list-form/vocab-list-form.component.ts:115:31
     const addVocabListSubsc = this.vocabService.add(vocabList)
       .subscribe(newListId => {
         // Check router navigation is done correctly?
-        this.router.navigate(["/vocab", "vocab-lists"]);
+        this.router.navigate(["", "vocab-lists"]);
         addVocabListSubsc.unsubscribe();
       });
