[Killed] ArrowFunction
app/vocab/vocab-lists/vocab-lists.component.ts:29:11
   public readonly vocabLists$: Observable<VocabList[]> = this.activatedRoute.data
     .pipe(
       map((data: Data) => data[ResolvedData.ResolvedLists]),
-      tap((data: VocabList[]) => this.vocabListsDisplay$.next(data)),
+      tap(() => undefined),
   );
 
killedBy: VocabListsComponent vocabListsDisplay$ Should have value from activated route.
statusReason: Expected [  ] to be [ Object({ name: 'Kitchen', listItems: [ Object({ id: '473573a8-86d7-4b64-8e51-96fead598a7c', wordType: 'Verb', german: 'essen', english: 'to reply, retort' }) ], authorName: 'Cain Harniess' }) ]. Tip: To check for deep equality, use .toEqual() instead of .toBe().
