[NoCoverage] BlockStatement
app/vocab-forms/vocab-list-item-form/vocab-list-item-form.component.ts:40:27
 
   }
 
-  public ngOnInit(): void {
-    // Can we test this?
-    this.wordType$ = this.form.controls.wordType.valueChanges
-      .pipe(
-        map((val: any) => val as WordType),
-    );
-
-    this.validationChanges$ = this.wordType$;
-    // Check subsribe is called?
-    this.validationChanges = this.validationChanges$.subscribe(wordType => this.updateFormConfiguration(wordType));
-  }
+  public ngOnInit(): void {}
 
   private updateFormConfiguration(wordType: WordType): void {

[NoCoverage] ArrowFunction
app/vocab-forms/vocab-list-item-form/vocab-list-item-form.component.ts:49:64
 
     this.validationChanges$ = this.wordType$;
     // Check subsribe is called?
-    this.validationChanges = this.validationChanges$.subscribe(wordType => this.updateFormConfiguration(wordType));
+    this.validationChanges = this.validationChanges$.subscribe(() => undefined);
   }
 

[NoCoverage] BlockStatement
app/vocab-forms/vocab-list-item-form/vocab-list-item-form.component.ts:52:61
     this.validationChanges = this.validationChanges$.subscribe(wordType => this.updateFormConfiguration(wordType));
   }
 
-  private updateFormConfiguration(wordType: WordType): void {
-    if (this.currentFormManager) {
-      //Check this is called?
-      this.currentFormManager.removeConfiguration();
-    }
-    // and this?
-    this.currentFormManager = this.formManagerFactory.create(wordType, this.form);
-    // and this?
-    this.currentFormManager.configureForm();
-  }
+  private updateFormConfiguration(wordType: WordType): void {}
 
   public get listItemsControl(): FormArray<FormGroup> {

[NoCoverage] BlockStatement
app/vocab-forms/vocab-list-item-form/vocab-list-item-form.component.ts:53:34
   }
 
   private updateFormConfiguration(wordType: WordType): void {
-    if (this.currentFormManager) {
-      //Check this is called?
-      this.currentFormManager.removeConfiguration();
-    }
+    if (this.currentFormManager) {}
     // and this?
     this.currentFormManager = this.formManagerFactory.create(wordType, this.form);
