[Killed] BooleanLiteral
app/vocab/pipes/separable-display.pipe.ts:10:70
   name: 'separableDisplay'
 })
 export class SeparableDisplayPipe implements PipeTransform {
-  transform(separability: Vague<Separability>, capitalise: boolean = true): Undefined<string> {
+  transform(separability: Vague<Separability>, capitalise: boolean = false): Undefined<string> {
     if (isNullOrUndefined(separability)) {
       return undefined;
killedBy: SeparableDisplayPipe transform Should return Separable when the input is Separable.
statusReason: Expected 'separable' to be 'Separable'.

[Killed] ConditionalExpression
app/vocab/pipes/separable-display.pipe.ts:11:9
 })
 export class SeparableDisplayPipe implements PipeTransform {
   transform(separability: Vague<Separability>, capitalise: boolean = true): Undefined<string> {
-    if (isNullOrUndefined(separability)) {
+    if (true) {
       return undefined;
     }
killedBy: SeparableDisplayPipe transform Should return Separable when the input is Separable.
statusReason: Expected undefined to be 'Separable'.

[NoCoverage] BlockStatement
app/vocab/pipes/separable-display.pipe.ts:11:42
 })
 export class SeparableDisplayPipe implements PipeTransform {
   transform(separability: Vague<Separability>, capitalise: boolean = true): Undefined<string> {
-    if (isNullOrUndefined(separability)) {
-      return undefined;
-    }
+    if (isNullOrUndefined(separability)) {}
 
     if (separability === Separability.None) {

[Killed] ConditionalExpression
app/vocab/pipes/separable-display.pipe.ts:15:9
       return undefined;
     }
 
-    if (separability === Separability.None) {
+    if (true) {
       return undefined;
     }
killedBy: SeparableDisplayPipe transform Should return Separable when the input is Separable.
statusReason: Expected undefined to be 'Separable'.

[Killed] ConditionalExpression
app/vocab/pipes/separable-display.pipe.ts:15:9
       return undefined;
     }
 
-    if (separability === Separability.None) {
+    if (false) {
       return undefined;
     }
killedBy: SeparableDisplayPipe transform Should return undefined when the input is None.
statusReason: Expected 'Inseparable' to be undefined.

[Killed] EqualityOperator
app/vocab/pipes/separable-display.pipe.ts:19:28
       return undefined;
     }
 
-    const output: string = separability === Separability.Separable ? "Separable" : "Inseparable";
+    const output: string = separability !== Separability.Separable ? "Separable" : "Inseparable";
     return capitalise ? output : output.toLowerCase();
   }
killedBy: SeparableDisplayPipe transform Should return Separable when the input is Separable.
statusReason: Expected 'Inseparable' to be 'Separable'.

[Killed] ConditionalExpression
app/vocab/pipes/separable-display.pipe.ts:19:28
       return undefined;
     }
 
-    const output: string = separability === Separability.Separable ? "Separable" : "Inseparable";
+    const output: string = true ? "Separable" : "Inseparable";
     return capitalise ? output : output.toLowerCase();
   }
killedBy: SeparableDisplayPipe transform Should return Inseparable when the input is Inseparable.
statusReason: Expected 'Separable' to be 'Inseparable'.

[Killed] MethodExpression
app/vocab/pipes/separable-display.pipe.ts:20:34
     }
 
     const output: string = separability === Separability.Separable ? "Separable" : "Inseparable";
-    return capitalise ? output : output.toLowerCase();
+    return capitalise ? output : output.toUpperCase();
   }
 }
killedBy: SeparableDisplayPipe transform Should return separable when the input is Separable.
statusReason: Expected 'SEPARABLE' to be 'separable'.
