[Killed] ConditionalExpression
app/vocab/services/in-memory-vocab-list.service.ts:53:9
   }
 
   public override addListItem(listItem: VocabListItem, listId: string): Observable<string> {
-    if (!isNullOrUndefined(listItem.id)) {
+    if (false) {
       throw new Error(`Item already has ID ${listItem.id}.`);
     }
killedBy: InMemoryVocabListService addListItem Should throw an error with the correct messageif the list item already has an ID value.
statusReason: Expected function to throw an exception with message 'Item already has ID a71da95c-5b9f-43ea-acd7-35d1f9fcce29.', but it threw an exception with message 'Vocab list with ID 9244e805-f3ea-4cad-9201-d38110c9b4fe not found in in-memory array.'.

[Killed] ConditionalExpression
app/vocab/services/in-memory-vocab-list.service.ts:53:9
   }
 
   public override addListItem(listItem: VocabListItem, listId: string): Observable<string> {
-    if (!isNullOrUndefined(listItem.id)) {
+    if (true) {
       throw new Error(`Item already has ID ${listItem.id}.`);
     }
killedBy: InMemoryVocabListService addListItem Should throw an error with the correct messageif the list item already has a vocab list ID value.
statusReason: Expected function to throw an exception with message 'Item already belongs to list with ID 9244e805-f3ea-4cad-9201-d38110c9b4fe.', but it threw an exception with message 'Item already has ID undefined.'.

[Killed] StringLiteral
app/vocab/services/in-memory-vocab-list.service.ts:54:23
 
   public override addListItem(listItem: VocabListItem, listId: string): Observable<string> {
     if (!isNullOrUndefined(listItem.id)) {
-      throw new Error(`Item already has ID ${listItem.id}.`);
+      throw new Error(``);
     }
 
killedBy: InMemoryVocabListService addListItem Should throw an error with the correct messageif the list item already has an ID value.
statusReason: Expected function to throw an exception with message 'Item already has ID a71da95c-5b9f-43ea-acd7-35d1f9fcce29.', but it threw an exception with message ''.

[Killed] ConditionalExpression
app/vocab/services/in-memory-vocab-list.service.ts:57:9
       throw new Error(`Item already has ID ${listItem.id}.`);
     }
 
-    if (!isNullOrUndefined(listItem.vocabListId)) {
+    if (true) {
       throw new Error(`Item already belongs to list with ID ${listItem.vocabListId}.`);
     }
killedBy: InMemoryVocabListService addListItem Should throw an error with the correct message if the vocab list ID is not found.
statusReason: Expected function to throw an exception with message 'Vocab list with ID 2333a7b8-e2d1-434a-9195-87abe3dde29e not found in in-memory array.', but it threw an exception with message 'Item already belongs to list with ID undefined.'.

[Killed] BooleanLiteral
app/vocab/services/in-memory-vocab-list.service.ts:57:9
       throw new Error(`Item already has ID ${listItem.id}.`);
     }
 
-    if (!isNullOrUndefined(listItem.vocabListId)) {
+    if (isNullOrUndefined(listItem.vocabListId)) {
       throw new Error(`Item already belongs to list with ID ${listItem.vocabListId}.`);
     }
killedBy: InMemoryVocabListService addListItem Should throw an error with the correct messageif the list item already has a vocab list ID value.
statusReason: Expected function to throw an exception with message 'Item already belongs to list with ID 9244e805-f3ea-4cad-9201-d38110c9b4fe.', but it threw an exception with message 'Vocab list with ID 9244e805-f3ea-4cad-9201-d38110c9b4fe not found in in-memory array.'.

[Survived] ArrowFunction
app/vocab/services/in-memory-vocab-list.service.ts:72:13
 
     return vocabList$
       .pipe(
-        tap((list: VocabList) => list.listItems.push(listItem)),
+        tap(() => undefined),
         map((list: VocabList) => listItem.id!),
       );

[Killed] EqualityOperator
app/vocab/services/in-memory-vocab-list.service.ts:88:54
   }
 
   private findIndex(id: string): number {
-    const index: number = this.lists.findIndex(vl => vl.id === id);
+    const index: number = this.lists.findIndex(vl => vl.id !== id);
 
     if (index === -1) {
killedBy: InMemoryVocabListService getWithId Should throw an error with the correct message if the ID is not found.; InMemoryVocabListService addListItem Should throw an error with the correct message if the vocab list ID is not found.
statusReason: Expected function to throw an Error.

[Killed] ConditionalExpression
app/vocab/services/in-memory-vocab-list.service.ts:88:54
   }
 
   private findIndex(id: string): number {
-    const index: number = this.lists.findIndex(vl => vl.id === id);
+    const index: number = this.lists.findIndex(vl => true);
 
     if (index === -1) {
killedBy: InMemoryVocabListService getWithId Should throw an error with the correct message if the ID is not found.; InMemoryVocabListService addListItem Should throw an error with the correct message if the vocab list ID is not found.
statusReason: Expected function to throw an Error.

[Killed] BlockStatement
app/vocab/services/in-memory-vocab-list.service.ts:90:23
   private findIndex(id: string): number {
     const index: number = this.lists.findIndex(vl => vl.id === id);
 
-    if (index === -1) {
-      throw new NotFoundError(`Vocab list with ID ${id} not found in in-memory array.`);
-    }
+    if (index === -1) {}
     return index;
   }
killedBy: InMemoryVocabListService getWithId Should throw an error with the correct message if the ID is not found.; InMemoryVocabListService addListItem Should throw an error with the correct message if the vocab list ID is not found.
statusReason: Expected function to throw an Error.
