[Killed] StringLiteral
app/vocab/vocab-lists/vocab-lists.component.ts:23:35
   public readonly showJson$ = new BehaviorSubject<boolean>(false);
   public readonly jsonButtonLabel$ = this.showJson$
     .pipe(
-      map((val: boolean) => val ? "Hide JSON" : "Show JSON"),
+      map((val: boolean) => val ? "" : "Show JSON"),
     );
 
killedBy: VocabListsComponent jsonButtonLabel$ JSON button label should be Hide JSON after exportToJson called once.
statusReason: Expected '' to be 'Hide JSON'.

[Killed] StringLiteral
app/vocab/vocab-lists/vocab-lists.component.ts:23:49
   public readonly showJson$ = new BehaviorSubject<boolean>(false);
   public readonly jsonButtonLabel$ = this.showJson$
     .pipe(
-      map((val: boolean) => val ? "Hide JSON" : "Show JSON"),
+      map((val: boolean) => val ? "Hide JSON" : ""),
     );
 
killedBy: VocabListsComponent jsonButtonLabel$ Initial JSON button label value should Show JSON.
statusReason: Expected '' to be 'Show JSON'.

[Killed] BlockStatement
app/vocab/vocab-lists/vocab-lists.component.ts:33:26
       tap((data: VocabList[]) => this.vocabListsDisplay$.next(data)),
     );
 
-  public addList(): void {
-    this.router.navigate(["new"], { relativeTo: this.route });
-  }
+  public addList(): void {}
 
   public editList(id: string): void {
killedBy: VocabListsComponent addList Should call Router.nagivate with correct arguments.
statusReason: Expected spy mockRouter.navigate to have been called only once, and with given args:
  [ [ 'new' ], Object({ relativeTo: Object({ data: Observable({ _subscribe: Function }) }) }) ]
But it was never called.


Error: Expected spy mockRouter.navigate to have been called only once, and with given args:
  [ [ 'new' ], Object({ relativeTo: Object({ data: Observable({ _subscribe: Function }) }) }) ]
But

[Killed] ArrayDeclaration
app/vocab/vocab-lists/vocab-lists.component.ts:34:26
     );
 
   public addList(): void {
-    this.router.navigate(["new"], { relativeTo: this.route });
+    this.router.navigate([], { relativeTo: this.route });
   }
 
killedBy: VocabListsComponent addList Should call Router.nagivate with correct arguments.
statusReason: Expected spy mockRouter.navigate to have been called only once, and with given args:
  [ [ 'new' ], Object({ relativeTo: Object({ data: Observable({ _subscribe: Function }) }) }) ]
But the actual call was:
  [ [  ], Object({ relativeTo: Object({ data: Observable({ _subscribe: Function }) }) }) ].
Expected $[0].length = 0 to equal 1.
Expected $[0][0] = undefined to equal 'new'.

[Killed] BlockStatement
app/vocab/vocab-lists/vocab-lists.component.ts:37:37
     this.router.navigate(["new"], { relativeTo: this.route });
   }
 
-  public editList(id: string): void {
-    this.router.navigate([id, "edit"], { relativeTo: this.route });
-  }
+  public editList(id: string): void {}
 
   public viewList(id: string): void {
killedBy: VocabListsComponent editList Should call Router.nagivate with correct arguments.
statusReason: Expected spy mockRouter.navigate to have been called only once, and with given args:
  [ [ '1234', 'edit' ], Object({ relativeTo: Object({ data: Observable({ _subscribe: Function }) }) }) ]
But it was never called.


Error: Expected spy mockRouter.navigate to have been called only once, and with given args:
  [ [ '1234', 'edit' ], Object({ relativeTo: Object({ data: Observable({ _subscribe: Functi

[Killed] ArrayDeclaration
app/vocab/vocab-lists/vocab-lists.component.ts:38:26
   }
 
   public editList(id: string): void {
-    this.router.navigate([id, "edit"], { relativeTo: this.route });
+    this.router.navigate([], { relativeTo: this.route });
   }
 
killedBy: VocabListsComponent editList Should call Router.nagivate with correct arguments.
statusReason: Expected spy mockRouter.navigate to have been called only once, and with given args:
  [ [ '1234', 'edit' ], Object({ relativeTo: Object({ data: Observable({ _subscribe: Function }) }) }) ]
But the actual call was:
  [ [  ], Object({ relativeTo: Object({ data: Observable({ _subscribe: Function }) }) }) ].
Expected $[0].length = 0 to equal 2.
Expected $[0][0] = undefined to equal '1234'.
Expected $

[Killed] StringLiteral
app/vocab/vocab-lists/vocab-lists.component.ts:38:31
   }
 
   public editList(id: string): void {
-    this.router.navigate([id, "edit"], { relativeTo: this.route });
+    this.router.navigate([id, ""], { relativeTo: this.route });
   }
 
killedBy: VocabListsComponent editList Should call Router.nagivate with correct arguments.
statusReason: Expected spy mockRouter.navigate to have been called only once, and with given args:
  [ [ '1234', 'edit' ], Object({ relativeTo: Object({ data: Observable({ _subscribe: Function }) }) }) ]
But the actual call was:
  [ [ '1234', '' ], Object({ relativeTo: Object({ data: Observable({ _subscribe: Function }) }) }) ].
Expected $[0][1] = '' to equal 'edit'.


Error: Expected spy mockRouter.navigate to

[Killed] BlockStatement
app/vocab/vocab-lists/vocab-lists.component.ts:41:37
     this.router.navigate([id, "edit"], { relativeTo: this.route });
   }
 
-  public viewList(id: string): void {
-    this.router.navigate([id], { relativeTo: this.route });
-  }
+  public viewList(id: string): void {}
 
   public exportToJson(): void {
killedBy: VocabListsComponent viewList Should call Router.nagivate with correct arguments.
statusReason: Expected spy mockRouter.navigate to have been called only once, and with given args:
  [ [ '1234' ], Object({ relativeTo: Object({ data: Observable({ _subscribe: Function }) }) }) ]
But it was never called.


Error: Expected spy mockRouter.navigate to have been called only once, and with given args:
  [ [ '1234' ], Object({ relativeTo: Object({ data: Observable({ _subscribe: Function }) }) }) ]
Bu

[Killed] ObjectLiteral
app/vocab/vocab-lists/vocab-lists.component.ts:42:32
   }
 
   public viewList(id: string): void {
-    this.router.navigate([id], { relativeTo: this.route });
+    this.router.navigate([id], {});
   }
 
killedBy: VocabListsComponent viewList Should call Router.nagivate with correct arguments.
statusReason: Expected spy mockRouter.navigate to have been called only once, and with given args:
  [ [ '1234' ], Object({ relativeTo: Object({ data: Observable({ _subscribe: Function }) }) }) ]
But the actual call was:
  [ [ '1234' ], Object({  }) ].
Expected $[1] to have properties
    relativeTo: Object({ data: Observable({ _subscribe: Function }) })
