[Killed] BlockStatement
app/vocab/vocab-lists-presenter/vocab-lists-presenter.component.ts:17:37
   @Output() public readonly view = new EventEmitter<string>();
   @Output() public readonly edit = new EventEmitter<string>();
 
-  public viewList(id: string): void {
-    this.view.emit(id);
-  }
+  public viewList(id: string): void {}
 
   public editList(id: string): void {
killedBy: VocabListsPresenter handleViewList Should fire view event.
statusReason: Expected spy emit to have been called only once, and with given args:
  [ '956919ac-d2a1-4225-93f3-bdf7e3180db8' ]
But it was never called.


Error: Expected spy emit to have been called only once, and with given args:
  [ '956919ac-d2a1-4225-93f3-bdf7e3180db8' ]
But it was never called.

[Killed] BlockStatement
app/vocab/vocab-lists-presenter/vocab-lists-presenter.component.ts:21:37
     this.view.emit(id);
   }
 
-  public editList(id: string): void {
-    this.edit.emit(id);
-  }
+  public editList(id: string): void {}
 }
 
killedBy: VocabListsPresenter handleEditList Should fire edit event.
statusReason: Expected spy emit to have been called only once, and with given args:
  [ '956919ac-d2a1-4225-93f3-bdf7e3180db8' ]
But it was never called.


Error: Expected spy emit to have been called only once, and with given args:
  [ '956919ac-d2a1-4225-93f3-bdf7e3180db8' ]
But it was never called.
