[NoCoverage] BlockStatement
app/vocab-forms/form-management/verb-form-manager.ts:9:41
 export class VerbFormManager extends IrregularFormManager {
   public get wordType(): WordType { return WordType.Verb; }
 
-  public override configureForm(): void {
-    super.configureForm();
-
-    const auxiliaryVerbControl: FormControl<AuxiliaryVerb | null> = this.controls.auxiliaryVerb!;
-    auxiliaryVerbControl.addValidators([Validators.required]);
-    auxiliaryVerbControl.updateValueAndValidity();
-
-    const SeparabilityControl: FormControl<Null<Separability>> = this.controls.separability;
-    SeparabilityControl.setValue(Separability.None);
-    SeparabilityControl.addValidators([Validators.required]);
-    SeparabilityControl.updateValueAndValidity();
-
-    const isTransitiveControl: FormControl<Null<boolean>> = this.controls.isTransitive;
-    isTransitiveControl.setValue(false);
-    isTransitiveControl.addValidators([Validators.required]);
-    isTransitiveControl.updateValueAndValidity();
-  }
+  public override configureForm(): void {}
 
   public override removeConfiguration(): void {

[NoCoverage] ArrayDeclaration
app/vocab-forms/form-management/verb-form-manager.ts:18:39
 
     const SeparabilityControl: FormControl<Null<Separability>> = this.controls.separability;
     SeparabilityControl.setValue(Separability.None);
-    SeparabilityControl.addValidators([Validators.required]);
+    SeparabilityControl.addValidators([]);
     SeparabilityControl.updateValueAndValidity();
 

[NoCoverage] BooleanLiteral
app/vocab-forms/form-management/verb-form-manager.ts:22:34
     SeparabilityControl.updateValueAndValidity();
 
     const isTransitiveControl: FormControl<Null<boolean>> = this.controls.isTransitive;
-    isTransitiveControl.setValue(false);
+    isTransitiveControl.setValue(true);
     isTransitiveControl.addValidators([Validators.required]);
     isTransitiveControl.updateValueAndValidity();

[NoCoverage] ArrayDeclaration
app/vocab-forms/form-management/verb-form-manager.ts:43:42
 
     const separabilityControl: FormControl<Null<Separability>> = this.controls.separability;
     separabilityControl.reset();
-    separabilityControl.removeValidators([Validators.required]);
+    separabilityControl.removeValidators([]);
     separabilityControl.updateValueAndValidity();
 

[NoCoverage] EqualityOperator
app/vocab-forms/form-management/verb-form-manager.ts:53:9
 
     const wasIrregular: Null<boolean> | null = this.cacheAndRemoveIrregularControl();
 
-    if (wasIrregular !== true) {
+    if (wasIrregular === true) {
       return;
     }

[NoCoverage] BlockStatement
app/vocab-forms/form-management/verb-form-manager.ts:59:56
     this.removeIrregularDependents();
   }
 
-  protected override removeIrregularDependents(): void {
-    const thirdPersonPresentControl: FormControl<Null<string>> = this.controls.thirdPersonPresent;
-    thirdPersonPresentControl.reset();
-    thirdPersonPresentControl.removeValidators([Validators.required]);
-    thirdPersonPresentControl.updateValueAndValidity();
-
-    const thirdPersonImperfectControl: FormControl<Null<string>> = this.controls.thirdPersonImperfect;
-    thirdPersonImperfectControl.reset();
-    thirdPersonImperfectControl.removeValidators([Validators.required]);
-    thirdPersonImperfectControl.updateValueAndValidity();
-  }
+  protected override removeIrregularDependents(): void {}
 }
 

[NoCoverage] ArrayDeclaration
app/vocab-forms/form-management/verb-form-manager.ts:62:48
   protected override removeIrregularDependents(): void {
     const thirdPersonPresentControl: FormControl<Null<string>> = this.controls.thirdPersonPresent;
     thirdPersonPresentControl.reset();
-    thirdPersonPresentControl.removeValidators([Validators.required]);
+    thirdPersonPresentControl.removeValidators([]);
     thirdPersonPresentControl.updateValueAndValidity();
 

[NoCoverage] ArrayDeclaration
app/vocab-forms/form-management/verb-form-manager.ts:67:50
 
     const thirdPersonImperfectControl: FormControl<Null<string>> = this.controls.thirdPersonImperfect;
     thirdPersonImperfectControl.reset();
-    thirdPersonImperfectControl.removeValidators([Validators.required]);
+    thirdPersonImperfectControl.removeValidators([]);
     thirdPersonImperfectControl.updateValueAndValidity();
   }
