[NoCoverage] StringLiteral
app/vocab-forms/services/list-item-wording-observable.provider.ts:10:8
     0: "Why not add something, sugar?",
     1: "Ooh yeah. You like that?",
     2: "Give me some more, baby.",
-    3: "I see someone's thirsty...",
+    3: "",
     4: "Thirsty for vocab",
     5: "Okay now, let's maybe calm down a bit.",

[NoCoverage] StringLiteral
app/vocab-forms/services/list-item-wording-observable.provider.ts:14:8
     4: "Thirsty for vocab",
     5: "Okay now, let's maybe calm down a bit.",
     6: "You've had enough.",
-    7: "You're scaring me.",
+    7: "",
     8: "I can't watch you do this to yourself.",
     9: "I'm leaving.",

[NoCoverage] StringLiteral
app/vocab-forms/services/list-item-wording-observable.provider.ts:17:9
     7: "You're scaring me.",
     8: "I can't watch you do this to yourself.",
     9: "I'm leaving.",
-    10: "You're on your own now.",
+    10: "",
     11: "",
   }
