[Killed] EqualityOperator
app/vocab-forms/services/list-title-observable.builder.ts:15:46
       .pipe(
         startWith(defaultValue),
         debounceTime(300),
-        map((val: string | null) => (!val || val === "") ? defaultValue : val),
+        map((val: string | null) => (!val || val !== "") ? defaultValue : val),
       );
   }
killedBy: ListTitleObservableBuilder build Should emit the control value if it is well-defined and not the empty string.
statusReason: Expected 'Default' to be 'Expected'.

[Survived] ConditionalExpression
app/vocab-forms/services/list-title-observable.builder.ts:15:46
       .pipe(
         startWith(defaultValue),
         debounceTime(300),
-        map((val: string | null) => (!val || val === "") ? defaultValue : val),
+        map((val: string | null) => (!val || false) ? defaultValue : val),
       );
   }
