[Killed] BlockStatement
app/vocab-forms/services/vocab-list-form-builder.service.ts:32:39
   }
 
   private patchListItems(form: FormGroup<VocabListForm>,
-    listItems: VocabListItem[]): void {
-    listItems.forEach((listItem: VocabListItem) => {
-      const listItemForm: FormGroup<VocabListItemForm> = this.listItemFormBuilder
-        .buildFromModel(listItem);
-        form.controls.listItems.push(listItemForm)
-    });
-  }
+    listItems: VocabListItem[]): void {}
 }
 
killedBy: VocabListFormBuilder buildFromList Should create FormArray with multiple vocab list item.
statusReason: Expected 0 to be 2.

[Killed] BlockStatement
app/vocab-forms/services/vocab-list-form-builder.service.ts:33:52
 
   private patchListItems(form: FormGroup<VocabListForm>,
     listItems: VocabListItem[]): void {
-    listItems.forEach((listItem: VocabListItem) => {
-      const listItemForm: FormGroup<VocabListItemForm> = this.listItemFormBuilder
-        .buildFromModel(listItem);
-        form.controls.listItems.push(listItemForm)
-    });
+    listItems.forEach((listItem: VocabListItem) => {});
   }
 }
killedBy: VocabListFormBuilder buildFromList Should create FormArray with multiple vocab list item.
statusReason: Expected 0 to be 2.
