[Killed] BlockStatement
app/vocab-forms/vocab-list-form/abstract-vocab-list-form.ts:31:27
   public title$!: Observable<string>;
   public descriptionLength$!: Observable<number>;
 
-  public ngOnInit(): void {
-    this.form = this.listFormBuilder.build();
-    const controls = this.form.controls;
-    this.descriptionLength$ = controls.description.valueChanges
-      .pipe(
-        map((val: string | null) => val ? val.length : 0),
-        filter((result: number) => result > 150),
-      );
-  }
+  public ngOnInit(): void {}
 
   public get listItemsControl(): FormArray {
killedBy: AddVocabListComponent ngOnInit Should build the vocab list form; AddVocabListComponent descriptionLength$ Should emit if length is greater than the specified value; AddVocabListComponent addListItemControl Should generate a new list item form.
statusReason: TypeError: Cannot read properties of undefined (reading 'controls')

[Killed] BlockStatement
app/vocab-forms/vocab-list-form/abstract-vocab-list-form.ts:45:37
     return this.form.controls.listItems;
   }
 
-  public addListItemControl(): void {
-    this.listItemsControl.push(this.generateListItemControl());
-    this.listItemControlCount$.next(this.listItemsControl.length);
-  }
+  public addListItemControl(): void {}
 
   protected generateListItemControl(): FormGroup {
killedBy: AddVocabListComponent addListItemControl Should generate a new list item form.; AddVocabListComponent removeListItemControl Should remove a list item form.
statusReason: Expected spy mockListItemFormBuilder.build to have been called only once, and with given args:
  [  ]
But it was never called.


Error: Expected spy mockListItemFormBuilder.build to have been called only once, and with given args:
  [  ]
But it was never called.

[Killed] BlockStatement
app/vocab-forms/vocab-list-form/abstract-vocab-list-form.ts:59:53
     return <FormGroup>this.listItemsControl.get(`${index}`);
   }
 
-  public removeListItemControl(index: number): void {
-    if (index < 0) {
-      throw new Error("Index may not be negative.");
-    } else if (index >= this.listItemsControl.length) {
-      throw new Error("Index exceeds the size of the list items form control array.")
-    }
-    this.listItemsControl.removeAt(index)
-    this.listItemControlCount$.next(this.listItemsControl.length);
-  }
+  public removeListItemControl(index: number): void {}
 
   public abstract submit(): void;
killedBy: AddVocabListComponent removeListItemControl Should throw exception if invalid index is provided.
statusReason: Expected function to throw an Error.

[Killed] EqualityOperator
app/vocab-forms/vocab-list-form/abstract-vocab-list-form.ts:62:16
   public removeListItemControl(index: number): void {
     if (index < 0) {
       throw new Error("Index may not be negative.");
-    } else if (index >= this.listItemsControl.length) {
+    } else if (index < this.listItemsControl.length) {
       throw new Error("Index exceeds the size of the list items form control array.")
     }
killedBy: AddVocabListComponent removeListItemControl Should not throw exception if index is valid.
statusReason: Expected function not to throw, but it threw Error: Index exceeds the size of the list items form control array..

[Killed] EqualityOperator
app/vocab-forms/vocab-list-form/abstract-vocab-list-form.ts:62:16
   public removeListItemControl(index: number): void {
     if (index < 0) {
       throw new Error("Index may not be negative.");
-    } else if (index >= this.listItemsControl.length) {
+    } else if (index > this.listItemsControl.length) {
       throw new Error("Index exceeds the size of the list items form control array.")
     }
killedBy: AddVocabListComponent removeListItemControl Should throw exception if index provided is greater than the list items control length.
statusReason: Expected function to throw an Error.

[Killed] StringLiteral
app/vocab-forms/vocab-list-form/abstract-vocab-list-form.ts:63:23
     if (index < 0) {
       throw new Error("Index may not be negative.");
     } else if (index >= this.listItemsControl.length) {
-      throw new Error("Index exceeds the size of the list items form control array.")
+      throw new Error("")
     }
     this.listItemsControl.removeAt(index)
killedBy: AddVocabListComponent removeListItemControl Should throw exception if index provided is greater than the list items control length.
statusReason: Expected function to throw an exception with message 'Index exceeds the size of the list items form control array.', but it threw an exception with message ''.

[Killed] BlockStatement
app/vocab-forms/vocab-list-form/abstract-vocab-list-form.ts:73:30
 
   protected subscriptions?: Subscription;
 
-  public ngOnDestroy(): void {
-    this.subscriptions?.unsubscribe()
-  }
+  public ngOnDestroy(): void {}
 }
 
killedBy: AddVocabListComponent ngOnDestroy Should unsubscribe from VocabListService.add subscription.
statusReason: Expected spy unsubscribe to have been called only once, and with given args:
  [  ]
But it was never called.


Error: Expected spy unsubscribe to have been called only once, and with given args:
  [  ]
But it was never called.
