[Killed] BlockStatement
app/vocab-forms/vocab-list-form/add-vocab-list-form.component.ts:30:36
 
   public override get editData(): Undefined<VocabList> { return undefined; }
 
-  public override ngOnInit(): void {
-    super.ngOnInit();
-    const controls: VocabListForm = this.form.controls;
-    this.title$ = this.title$Builder.build("New vocab list", controls.name);
-    this.placeholderWording$ = this.listItemWording$Provider
-      .provide(this.listItemControlCount$);
-  }
+  public override ngOnInit(): void {}
 
   public placeholderWording$!: Observable<string>;
killedBy: AddVocabListComponent ngOnInit Should build the vocab list form; AddVocabListComponent descriptionLength$ Should emit if length is greater than the specified value; AddVocabListComponent addListItemControl Should generate a new list item form.
statusReason: Expected spy mockListFormBuilder.build to have been called only once, and with given args:
  [  ]
But it was never called.


Error: Expected spy mockListFormBuilder.build to have been called only once, and with given args:
  [  ]
But it was never called.

[Killed] StringLiteral
app/vocab-forms/vocab-list-form/add-vocab-list-form.component.ts:33:44
   public override ngOnInit(): void {
     super.ngOnInit();
     const controls: VocabListForm = this.form.controls;
-    this.title$ = this.title$Builder.build("New vocab list", controls.name);
+    this.title$ = this.title$Builder.build("", controls.name);
     this.placeholderWording$ = this.listItemWording$Provider
       .provide(this.listItemControlCount$);
killedBy: AddVocabListComponent ngOnInit Should call title observable builder with correct arguments.
statusReason: Expected spy mockObservableBuilderForMocks.build to have been called only once, and with given args:
  [ 'New vocab list', Object({ value: 'Current value', valueChanges: Observable({ _subscribe: Function }) }) ]
But the actual call was:
  [ '', Object({ value: 'Current value', valueChanges: Observable({ _subscribe: Function }) }) ].
Expected $[0] = '' to equal 'New vocab list'.


Error: Expected s

[Killed] BlockStatement
app/vocab-forms/vocab-list-form/add-vocab-list-form.component.ts:40:34
 
   public placeholderWording$!: Observable<string>;
 
-  public override submit(): void {
-    const vocabList: VocabList = this.form.value as VocabList;
-    this.subscriptions = this.vocabService.add(vocabList)
-      .subscribe(newListId => {
-        this.router.navigate(["/vocab", "vocab-lists"]);
-      });
-  }
+  public override submit(): void {}
 }
 
killedBy: AddVocabListComponent submit Should call the add method on the vocab list service with the correct argument.; AddVocabListComponent ngOnDestroy Should unsubscribe from VocabListService.add subscription.
statusReason: Expected spy mockListService.add to have been called only once, and with given args:
  [ 'Mock form value' ]
But it was never called.


Error: Expected spy mockListService.add to have been called only once, and with given args:
  [ 'Mock form value' ]
But it was never called.

[Killed] BlockStatement
app/vocab-forms/vocab-list-form/add-vocab-list-form.component.ts:43:31
   public override submit(): void {
     const vocabList: VocabList = this.form.value as VocabList;
     this.subscriptions = this.vocabService.add(vocabList)
-      .subscribe(newListId => {
-        this.router.navigate(["/vocab", "vocab-lists"]);
-      });
+      .subscribe(newListId => {});
   }
 }
killedBy: AddVocabListComponent submit Should call Router.navigate with the correct arguments.
statusReason: Expected spy mockRouter.navigate to have been called only once, and with given args:
  [ [ '/vocab', 'vocab-lists' ] ]
But it was never called.


Error: Expected spy mockRouter.navigate to have been called only once, and with given args:
  [ [ '/vocab', 'vocab-lists' ] ]
But it was never called.

[Killed] StringLiteral
app/vocab-forms/vocab-list-form/add-vocab-list-form.component.ts:44:31
     const vocabList: VocabList = this.form.value as VocabList;
     this.subscriptions = this.vocabService.add(vocabList)
       .subscribe(newListId => {
-        this.router.navigate(["/vocab", "vocab-lists"]);
+        this.router.navigate(["", "vocab-lists"]);
       });
   }
killedBy: AddVocabListComponent submit Should call Router.navigate with the correct arguments.
statusReason: Expected spy mockRouter.navigate to have been called only once, and with given args:
  [ [ '/vocab', 'vocab-lists' ] ]
But the actual call was:
  [ [ '', 'vocab-lists' ] ].
Expected $[0][0] = '' to equal '/vocab'.


Error: Expected spy mockRouter.navigate to have been called only once, and with given args:

[Killed] StringLiteral
app/vocab-forms/vocab-list-form/add-vocab-list-form.component.ts:44:41
     const vocabList: VocabList = this.form.value as VocabList;
     this.subscriptions = this.vocabService.add(vocabList)
       .subscribe(newListId => {
-        this.router.navigate(["/vocab", "vocab-lists"]);
+        this.router.navigate(["/vocab", ""]);
       });
   }
killedBy: AddVocabListComponent submit Should call Router.navigate with the correct arguments.
statusReason: Expected spy mockRouter.navigate to have been called only once, and with given args:
  [ [ '/vocab', 'vocab-lists' ] ]
But the actual call was:
  [ [ '/vocab', '' ] ].
Expected $[0][1] = '' to equal 'vocab-lists'.


Error: Expected spy mockRouter.navigate to have been called only once, and with given args:
