[Killed] BlockStatement
app/vocab-forms/vocab-list-form/edit-vocab-list.component.ts:34:36
 
   public override get editData(): Undefined<VocabList> { return this.preEditList; }
 
-  public override ngOnInit(): void {
-    super.ngOnInit();
-
-    const controls = this.form.controls;
-    this.title$ = this.title$Builder.build(this.preEditList.name, controls.name);
-    this.form.patchValue(this.preEditList);
-
-    const listItemsControl = controls.listItems;
-    const initialListItems = this.preEditList.listItems
-    initialListItems.forEach((item: VocabListItem) => {
-      const itemControl = this.listItemFormBuilder.build();
-      listItemsControl.push(itemControl);
-    });
-  }
+  public override ngOnInit(): void {}
 
   public readonly placeholderWording$: Observable<string> = EMPTY;
killedBy: EditVocabListComponent ngOnInit Should call title observable builder with correct arguments.
statusReason: Expected spy mockObservableBuilderForMocks.build to have been called only once, and with given args:
  [ 'Stub Vocab List', Object({ value: 'Current value', valueChanges: Observable({ _subscribe: Function }) }) ]
But it was never called.


Error: Expected spy mockObservableBuilderForMocks.build to have been called only once, and with given args:
  [ 'Stub Vocab List', Object({ value: 'Current valu

[NoCoverage] BlockStatement
app/vocab-forms/vocab-list-form/edit-vocab-list.component.ts:43:55
 
     const listItemsControl = controls.listItems;
     const initialListItems = this.preEditList.listItems
-    initialListItems.forEach((item: VocabListItem) => {
-      const itemControl = this.listItemFormBuilder.build();
-      listItemsControl.push(itemControl);
-    });
+    initialListItems.forEach((item: VocabListItem) => {});
   }
 

[NoCoverage] BlockStatement
app/vocab-forms/vocab-list-form/edit-vocab-list.component.ts:51:25
 
   public readonly placeholderWording$: Observable<string> = EMPTY;
 
-  public submit(): void {
-    const vocabList: VocabList = this.form.value as VocabList;
-    vocabList.id = this.preEditList.id;
-    this.vocabService.update(vocabList)
-      .subscribe((vl: VocabList) => {
-        this.router.navigate(["/vocab", "vocab-lists"]);
-      });
-  }
+  public submit(): void {}
 }
 

[NoCoverage] BlockStatement
app/vocab-forms/vocab-list-form/edit-vocab-list.component.ts:55:37
     const vocabList: VocabList = this.form.value as VocabList;
     vocabList.id = this.preEditList.id;
     this.vocabService.update(vocabList)
-      .subscribe((vl: VocabList) => {
-        this.router.navigate(["/vocab", "vocab-lists"]);
-      });
+      .subscribe((vl: VocabList) => {});
   }
 }
