[NoCoverage] BlockStatement
app/vocab-forms/vocab-list-item-form/vocab-list-item-form.component.ts:44:27
 
   }
 
-  public ngOnInit(): void {
-    // Can we test this?
-    const controls: VocabListItemForm = this.form.controls;
-    this.wordType$ = this.constructWordType$(this.listItem, controls.wordType);
-
-    this.validationChanges$ = this.wordType$;
-    // Check subscribe is called?
-    this.validationChanges = this.validationChanges$.subscribe(wordType => {
-      this.updateFormConfiguration(wordType)
-    });
-
-    if (!this.listItem) {
-      return;
-    }
-    this.form.patchValue(this.listItem);
-  }
+  public ngOnInit(): void {}
 
   private constructWordType$(listItem: Undefined<VocabListItem>, wordTypeControl: FormControl<Null<WordType>>): Observable<WordType> {

[NoCoverage] BlockStatement
app/vocab-forms/vocab-list-item-form/vocab-list-item-form.component.ts:51:76
 
     this.validationChanges$ = this.wordType$;
     // Check subscribe is called?
-    this.validationChanges = this.validationChanges$.subscribe(wordType => {
-      this.updateFormConfiguration(wordType)
-    });
+    this.validationChanges = this.validationChanges$.subscribe(wordType => {});
 
     if (!this.listItem) {
