[Killed] ConditionalExpression
Angular/src/utilities/object.utilities.ts:2:10
 export function isNullOrUndefined(object: any): boolean {
-  return isNull(object) || isUndefined(object);
+  return true;
 }
 
killedBy: VocabListItemFormBuilder build Should set wordType validator to beValidators.required.; VocabListItemFormBuilder buildFromModel Should set wordType validator to beValidators.required.; SeparableDisplayPipe transform Should return Separable when the input is Separable.
statusReason: Expected Function to be null. Tip: To check for deep equality, use .toEqual() instead of .toBe().

[Killed] ConditionalExpression
Angular/src/utilities/object.utilities.ts:6:10
 }
 
 export function isNull(object: any): boolean {
-  return object === null;
+  return true;
 }
 
killedBy: VocabListItemFormBuilder build Should set wordType validator to beValidators.required.; VocabListItemFormBuilder buildFromModel Should set wordType validator to beValidators.required.; SeparableDisplayPipe transform Should return Separable when the input is Separable.
statusReason: Expected Function to be null. Tip: To check for deep equality, use .toEqual() instead of .toBe().

[Killed] ConditionalExpression
Angular/src/utilities/object.utilities.ts:10:10
 }
 
 export function isUndefined(object: any): boolean {
-  return object === undefined;
+  return true;
 }
 
killedBy: VocabListItemFormBuilder build Should set wordType validator to beValidators.required.; VocabListItemFormBuilder buildFromModel Should set wordType validator to beValidators.required.; SeparableDisplayPipe transform Should return Separable when the input is Separable.
statusReason: Expected Function to be null. Tip: To check for deep equality, use .toEqual() instead of .toBe().

[Killed] EqualityOperator
Angular/src/utilities/object.utilities.ts:10:10
 }
 
 export function isUndefined(object: any): boolean {
-  return object === undefined;
+  return object !== undefined;
 }
 
killedBy: VocabListItemFormBuilder build Should set wordType validator to beValidators.required.; VocabListItemFormBuilder buildFromModel Should set wordType validator to beValidators.required.; SeparableDisplayPipe transform Should return Separable when the input is Separable.
statusReason: Expected Function to be null. Tip: To check for deep equality, use .toEqual() instead of .toBe().
