[Survived] StringLiteral
Angular/src/utilities/testing.utilities.ts:7:14
 export function createStubListItem(wordType?: WordType): VocabListItem {
   return {
     wordType: wordType ?? WordType.Noun,
-    english: "englishWord",
+    english: "",
     german: "germanWord",
   };
